&НаКлиенте
Процедура УдалитьКарточку(Команда)
	УдалитьКарточкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьКарточкуНаСервере()

	Хост	= PocketKey_Модуль.PocketKey_ОпределитьАдресСервера();
	Порт	= 8008;
	
	Если НЕ ЗначениеЗаполнено(Хост) Тогда
		Сообщить("Клуб не определен");
		Возврат;
	КонецЕсли;
	
	Метод	= "delete_person.php";
	cid	= Идентификатор;
	
	//Запрос = "/" + Метод + "?" + "cid=" + cid; 
		
	//HTTPСоединение	= Новый HTTPСоединение(Хост, Порт);	  
	//HTTPЗапрос		= Новый HTTPЗапрос(Запрос, Новый Соответствие());	
	//HTTPСоединение.Получить(HTTPЗапрос);
	
	// Пример запроса: 192.168.170.10:8008/delete_person.php?cid=C000046953

КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтрагентПриИзменении(Элемент)
	ВыборКонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыборКонтрагентПриИзмененииНаСервере()
		
	ВыборКонтрагент2 = ВыборКонтрагент.ПолучитьОбъект();
	Идентификатор = "C" + Строка(ВыборКонтрагент2.Код);
	
КонецПроцедуры

