// Процедура, записывает событие в журнал.
//
Процедура ЛогироватьСобытие(СтруктурнаяЕдиница
	                       ,Дата
						   ,ТипСобытия      = Неопределено
						   ,КодКарты        = Неопределено
						   ,Карта           = Неопределено
						   ,Устройство      = Неопределено
						   ,Наименование    = Неопределено
						   ,Направление     = Неопределено
						   ,Описание        = Неопределено
						   ,Основание       = Неопределено
						   ,ВремяВыполнения = Неопределено
						   ,Гость           = Неопределено
						   ,Помещение       = Неопределено) Экспорт
	
	РегистрыСведений.ЖурналСобытийСКУД_КОРП.ЗаписатьСобытиеВЖурнал(Дата, ТипСобытия, КодКарты, Карта, Устройство, Помещение, Направление, Описание, Основание, ВремяВыполнения, Гость, СтруктурнаяЕдиница,,,,, Наименование);	
	
КонецПроцедуры

// Функция, возвращает ответ 1с.
//
Функция СформироватьОтвет(Доступ, Текст, УИДКлиента) Экспорт
		
	Ответ1С = Новый Структура;	
	Ответ1С.Вставить("client_id"   , УИДКлиента);
	Ответ1С.Вставить("text"        , Текст);	
	Ответ1С.Вставить("grant_access", Доступ);
	 		
	Возврат ПолучитьHTTPОтвет(Ответ1С); 	
	
КонецФункции

// Функция, возвращает HTTPОтвет. 
//
Функция ПолучитьHTTPОтвет(Ответ1с) Экспорт
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);				
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, Ответ1С);          	
	
	мОтвет = ЗаписьJSON.Закрыть(); 		
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.УстановитьТелоИзСтроки(мОтвет);
	HTTPОтвет.Заголовки["Content-Type"] = "application/json";		
	
	Возврат HTTPОтвет; 
	
КонецФункции
                                                 