//Функция возвращает Истина ,если сотрудник есть в сегменте доступа
//
//Сотрудник - Справочник.Ссылка - Сотрудник клуба 
//
Функция СотрудникНаходитсяВСегменте_ДоступСотрудников_ВИП(Сотрудник)Экспорт 

	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ОбъектСегмента КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента = &ОбъектСегмента
	|	И СоставСегментов.Сегмент.Наименование ПОДОБНО ""Доступ сотрудников ВИП""
	|";
	
	Запрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("ОбъектСегмента", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//Функция возвращает Истина ,если сотрудник есть в сегменте доступа
//
//Сотрудник - Справочник.Ссылка - Сотрудник клуба 
//
Функция СотрудникНаходитсяВСегменте_ДоступСотрудников_СПА_УЛБАСС(Сотрудник)Экспорт 

	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ОбъектСегмента КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента = &ОбъектСегмента
	|	И СоставСегментов.Сегмент.Наименование ПОДОБНО ""Доступ сотрудников СПА+ УЛ.БАСС""
	|";
	
	Запрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("ОбъектСегмента", Сотрудник);
		
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//Функция возвращает Истина ,если сотрудник есть в сегменте доступа
//
//Сотрудник - Справочник.Ссылка - Сотрудник клуба 
//
Функция СотрудникНаходитсяВСегменте_ДоступVIP_терминалы_ЧК(Сотрудник)Экспорт 

	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ОбъектСегмента КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента = &ОбъектСегмента
	|	И СоставСегментов.Сегмент.Наименование ПОДОБНО ""Доступ VIP(терминалы ЧК)""
	|";
	
	Запрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("ОбъектСегмента", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//Функция возвращает Истина ,если Номенклатура есть в сегменте доступа
//
//Номенклатура - Справочник.Ссылка - Номенклатура клуба 
//
Функция СегментНоменклатуры_СПА_УЛБАС(Номенклатура)Экспорт 

	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставСегментов.ОбъектСегмента КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СоставСегментов КАК СоставСегментов
	|ГДЕ
	|	СоставСегментов.ОбъектСегмента = &ОбъектСегмента
	|	И СоставСегментов.Сегмент.Наименование ПОДОБНО ""ТК+УЛ.БАС""
	|";
	
	Запрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("ОбъектСегмента", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//++ ЗМВ 26.06.2025

//Функция проверяет есть ли у ЧК остаток занятий 
//
//Таблица остатков - Таблица значений - Таблица остатка резерва пакета услуг
//
Функция КоличестовУслугОстаток(ТаблицаОстатков) Экспорт
	
	ЕстьРезерв = Ложь;
	
	Для каждого Строка Из ТаблицаОстатков Цикл
		
		Если Строка.КоличествоОстаток <> 0 Тогда
			Если Строка.КоличествоРезерв <= Строка.КоличествоОстаток Тогда
				ЕстьРезерв = Истина;
			КонецЕсли;		  
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ЕстьРезерв;
	 
КонецФункции
//-- ЗМВ 26.06.2025