// Функция, общий модуль для исключений
// Основание - номенклатура или клиент
Функция PocketKey_ИсключитьИзПроверки(Основание, Наименование) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
					|	СоставСегментов.Сегмент КАК Сегмент,
					|	СоставСегментов.ОбъектСегмента КАК ОбъектСегмента
					|ИЗ
					|	РегистрСведений.СоставСегментов КАК СоставСегментов
					|ГДЕ
					|	СоставСегментов.Сегмент.Наименование = &Наименование
					|	И СоставСегментов.ОбъектСегмента = &Основание
					|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр(	"Наименование",		Наименование);
	Запрос.УстановитьПараметр(	"Основание",		Основание);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Функция, возвращает сотрудников которым разрешено проходить в любое время
// Основание - номенклатура или клиент
Функция PocketKey_ИсключитьИзПроверкиНаВремяПосещения(Основание) Экспорт
		
	Возврат PocketKey_ИсключитьИзПроверки(Основание, "Исключить из проверки на время посещения");
		
КонецФункции

// Функция, возвращает сотрудников которым разрешен двойной проход
// Основание - клиент
Функция PocketKey_ИсключитьИзПроверкиНаДвойнойПроход(Основание) Экспорт
	
	Возврат PocketKey_ИсключитьИзПроверки(Основание, "Исключить из проверки на двойной проход");
	
КонецФункции

// Функция, возвращает сотрудников которым не выставляется штраф
// Основание - клиент
Функция PocketKey_ИсключитьИзПроверкиНаШтраф(Основание) Экспорт
	
	Возврат PocketKey_ИсключитьИзПроверки(Основание, "Исключить из проверки на штраф");
	
КонецФункции

// Функция, возвращает сотрудников которым разрешен проезд на парковку
// Основание - клиент
Функция PocketKey_ИсключитьИзПроверкиНаПроезд(Основание) Экспорт
	
	Возврат PocketKey_ИсключитьИзПроверки(Основание, "Исключить из проверки на проезд");
	
КонецФункции
