#Область ОбработчикиСобытийФормы
//++ ЗМВ 03.06.2025
&НаКлиенте
Процедура PocketKey_ПриОткрытииПосле(Отказ)
	PocketKey_ПриОткрытииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура PocketKey_ПриОткрытииПослеНаСервере()
	
	ЭтоУДК 	= СотрудникЯвляетсяУДК();
	ЭтоЗУДК = СотрудникЯвляетсяЗУДК();
	
	//Изменен на ЗУДК пока в клубе нет УДК
	Если ВРег(Объект.Наименование) = ВРег("Исключить из проверки на QR") И ЭтоУДК Тогда // Сгемент "Исключить из проверки на QR"
	//Если ВРег(Объект.Наименование) = ВРег("Исключить из проверки на QR") И ЭтоЗУДК Тогда // Сгемент "Исключить из проверки на QR"
		Элементы.СформироватьСегмент.Доступность = Истина;
		Элементы.ДобавитьВСегмент.Доступность = Истина;
		Элементы.УдалитьИзСегмента.Доступность = Истина;
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
//-- ЗМВ 03.06.2025	

#КонецОбласти

#Область СулжебныеПроцедурыИФункцииФормы

//++ ЗМВ 03.06.2025

//Функция проверяет должность текущего пользователя 
//
Функция СотрудникЯвляетсяУДК()
	
	УДК = Ложь;
	
	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Должность.Наименование ПОДОБНО ""%Управляющий делами клуба%""
	|	И НЕ Сотрудники.ПометкаУдаления
	|";
	
	лЗапрос = Новый Запрос(лТекст);	
	
	лВыборка = лЗапрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из лВыборка Цикл
		Если Строка.Ссылка.Наименование = Пользователи.ТекущийПользователь().Наименование  Тогда
			УДК = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат УДК;
	
КонецФункции

//Функция для возвращает есть ли у пользователя полные права
//
Функция ПолныеПрава()

	Если РольДоступна("ПолныеПрава") Тогда	
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;

КонецФункции // ()

&НаКлиенте
&Вместо("ДобавитьВСегмент")
Процедура PocketKey_ДобавитьВСегмент(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьВСегментОтвет", ЭтотОбъект), НСтр("ru='Для выполнения данной операции необходимо записать элемент. Записать?';en='For run given operations is necessary writedown element. WriteDown?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	//++ ЗМВ 08.09.2025
	//ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина),,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", Новый Структура("МножественныйВыбор, ОтображениеТаблицы", Ложь, ОтображениеТаблицы.Список),,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
    //-- ЗМВ 08.09.2025

КонецПроцедуры
//-- ЗМВ 03.06.2025

//Функция проверяет должность текущего пользователя 
//
Функция СотрудникЯвляетсяЗУДК()
	
	ЗУДК = Ложь;
	
	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И Сотрудники.Должность.Наименование ПОДОБНО ""Заместитель управляющего делами клуба""
	|";
	
	Запрос = Новый Запрос(лТекст);
		
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Выгрузка Цикл
		Если Строка.Ссылка.Наименование = Пользователи.ТекущийПользователь().Наименование  Тогда
			ЗУДК = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ЗУДК;

КонецФункции 

//++ ZMV 19.12.2025
//-- ZMV 19.12.2025 
//
#КонецОбласти

