Функция ПроверкаНеИспользоватьБиометрию(ВладалецКарты ,ИдУстройства ,СтруктурнаяЕдиница) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТФ_ИспользованиеБиометрии.СегментКлиентов КАК СегментКлиентов
	|ИЗ
	|	РегистрСведений.ТФ_ИспользованиеБиометрии КАК ТФ_ИспользованиеБиометрии
	|ГДЕ
	|	ТФ_ИспользованиеБиометрии.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ТФ_ИспользованиеБиометрии.ИдУстройства = &ИдУстройства	
	|";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ИдУстройства", ИдУстройства);
	
	СегментКлиентов = Запрос.Выполнить().Выгрузить();
	
	КлиентВСегменте = ПолучитьСоставСегментКлиентов(ВладалецКарты,СегментКлиентов);
	
	Если КлиентВСегменте Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции //ПроверкаНеИспользоватьБиометрию ()


Функция ПолучитьСоставСегментКлиентов(Клиент ,Сегмент)
	
	СегментКлиентов = Сегмент;
	Если НЕ СегментКлиентов.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|СоставСегментов.ОбъектСегмента КАК КлиентСегмента
		|ИЗ
		|	РегистрСведений.СоставСегментов КАК СоставСегментов
		|ГДЕ
		|	СоставСегментов.Сегмент = &Сегмент
		|	И СоставСегментов.ОбъектСегмента = &Клиент";
		
		Запрос.УстановитьПараметр("Сегмент", СегментКлиентов[0].СегментКлиентов);
		Запрос.УстановитьПараметр("Клиент", Клиент);
		
		РезультатЗапроса = Запрос.Выполнить();    
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат Истина;
		КонецЦикла;					
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ПолучитьНоменклатуруИзСегмента()