#Область ОбработчикиСобытийФормы

//++ ЗМВ 10.06.2025
&НаКлиенте
Процедура PocketKey_ПриОткрытииПосле(Отказ)
	PocketKey_ПриОткрытииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура PocketKey_ПриОткрытииПослеНаСервере()
	
	ЭтоУДК = СотрудникЯвляетсяУДК();
	
	Если ВРег(Объект.Наименование) = ВРег("Доступ сотрудников СПА+ УЛ.БАСС") ИЛИ ВРег(Объект.Наименование) = ВРег("Доступ сотрудников ВИП") И ЭтоУДК  Тогда
		Элементы.СформироватьСегмент.Доступность = Истина;
		Элементы.ДобавитьВСегмент.Доступность = Истина;
		Элементы.УдалитьИзСегмента.Доступность = Истина;
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
//-- ЗМВ 10.06.2025

#КонецОбласти

#Область СулжебныеПроцедурыИФункцииФормы

//++ ЗМВ 03.06.2025

//Функция проверяет должность текущего пользователя 
//
Функция СотрудникЯвляетсяУДК()
	
	УДК = Ложь;
	
	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Должность = &Должность
	|	И НЕ Сотрудники.ПометкаУдаления
	|";
	
	лЗапрос = Новый Запрос(лТекст);
	
	// Присвоение значений переменным параметров.
	Должность = Справочники.Должности.НайтиПоНаименованию("Управляющий делами клуба"); // Управляющий делами клуба (000000013)
	
	// Установка параметров.
	лЗапрос.УстановитьПараметр("Должность", Должность);
	
	
	лВыборка = лЗапрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из лВыборка Цикл
		Если Строка.Ссылка.Наименование = Пользователи.ТекущийПользователь().Наименование  Тогда
			УДК = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат УДК;
	
КонецФункции // ()

//Функция для возвращает есть ли у пользователя полные права
//
Функция ПолныеПрава()

	Если РольДоступна("ПолныеПрава") Тогда	
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;

КонецФункции // ()
//-- ЗМВ 03.06.2025

//Функция проверяет должность текущего пользователя 
//
Функция СотрудникЯвляетсяЗУДК()
	
	ЗУДК = Ложь;
	
	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И Сотрудники.Должность.Наименование ПОДОБНО ""Заместитель управляющего делами клуба""
	|";
	
	Запрос = Новый Запрос(лТекст);
		
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Выгрузка Цикл
		Если Строка.Ссылка.Наименование = Пользователи.ТекущийПользователь().Наименование  Тогда
			ЗУДК = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ЗУДК;

КонецФункции 

#КонецОбласти
