&НаСервере
&Вместо("ОбновитьОбщуюИнформацию")
Процедура PocketKey_ОбновитьОбщуюИнформацию()

	ПараметрыПосещения  = Документы.Посещение.ДанныеПоследнегоВходаКлиента(ТекущийКлиент, Неопределено, Неопределено, Истина);
	ТекущийКлиентВКлубе = ПараметрыПосещения <> Неопределено И ПараметрыПосещения.ПосещениеЗакрыто = Ложь;

	Если ОбщегоНазначения.НаличиеЭлементаФормы(ЭтаФорма, "КнопкаПродажи") Тогда 
		Элементы.КнопкаПродажи.Доступность = ЭтотОбъект.БыстраяПродажа ИЛИ ЗначениеЗаполнено(ЭтотОбъект.ТекущийКлиент);
	КонецЕсли;

	Если Не Элементы.Найти("АрендаВыдать") = Неопределено Тогда
		Элементы.АрендаВыдать.Доступность   = ЗначениеЗаполнено(ЭтотОбъект.ТекущийКлиент);
	КонецЕсли;
	Элементы.КнопкаЗапись.Доступность   = ЗначениеЗаполнено(ЭтотОбъект.ТекущийКлиент);
	Элементы.КнопкаВозврата.Доступность = ЗначениеЗаполнено(ЭтотОбъект.ТекущийКлиент);

	Элементы.ТекущаяКартаКлиента.Видимость = ЗначениеЗаполнено(ЭтотОбъект.ТекущаяКартаКлиента);


	Если ЭтотОбъект.ИспользоватьРегистрациюВходаВыхода = Истина Тогда

		Если ЗначениеЗаполнено(ПараметрыПосещения) И ПараметрыПосещения.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница Тогда			
			Элементы.КнопкаВыполнитьВходВыходКлиента.Заголовок   = ?(ТекущийКлиентВКлубе, Нстр("ru='ВЫХОД';en='EXIT'"), Нстр("ru='ВХОД';en='ENTRANCE'"));
		Иначе                                                                                                                                            
			Элементы.КнопкаВыполнитьВходВыходКлиента.Заголовок   = Нстр("ru='ВХОД';en='ENTRANCE'");			
		КонецЕсли;
		Элементы.КнопкаВыполнитьВходВыходКлиента.Доступность = ЗначениеЗаполнено(ЭтотОбъект.ТекущийКлиент);	

	КонецЕсли;

	Если ПараметрыПосещения <> Неопределено 
		И ПараметрыПосещения.Ключ.ЗанятКлиентом = ТекущийКлиент Тогда

		ТекущийКлюч  = ПараметрыПосещения.Ключ;

	ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект.ТекущийКлиент)
		ИЛИ  ТекущийКлюч.ЗакрепленЗаКлиентом <> ЭтотОбъект.ТекущийКлиент Тогда

		ТекущийКлюч  = Неопределено;

	КонецЕсли;

	ИспользоватьБилетнуюСистему = ЭтотОбъект.БилетнаяСистема И ЭтотОбъект.ТекущийКлиент.ОбезличенныйКлиент;

	Элементы.ГруппаКлючВхода.Видимость        		  = Не ИспользоватьБилетнуюСистему И ИспользоватьКлючи;
	Элементы.ПосещенияНаСегодняКлюч.Видимость 		  = Не ИспользоватьБилетнуюСистему И ИспользоватьКлючи;
	Элементы.ПосещенияНаСегодняПечатьБилета.Видимость = ИспользоватьБилетнуюСистему;

	Элементы.ГруппаВозврастКлиента.Видимость = Не ЭтотОбъект.ТекущийКлиент.ОбезличенныйКлиент;
	Элементы.ОблакоЗаметок.Видимость 		 = Не ЭтотОбъект.ТекущийКлиент.ОбезличенныйКлиент;
	Элементы.ОблакоТегов.Видимость 			 = Не ЭтотОбъект.ТекущийКлиент.ОбезличенныйКлиент;
	//Элементы.ГруппаИнвентарьАренда.Видимость = Не ЭтотОбъект.ТекущийКлиент.ОбезличенныйКлиент;

	Элементы.ТекущийКлиент.МаксимальнаяШирина = 106;
	Элементы.ТекущийКлиент.МаксимальнаяШирина = Элементы.ТекущийКлиент.МаксимальнаяШирина - ?(Элементы.ТекущаяКартаКлиента.Видимость, 14, 0);
	Элементы.ТекущийКлиент.МаксимальнаяШирина = Элементы.ТекущийКлиент.МаксимальнаяШирина - ?(Элементы.ГруппаКлючВхода.Видимость, 14, 0);
	Элементы.ТекущийКлиент.МаксимальнаяШирина = Элементы.ТекущийКлиент.МаксимальнаяШирина - ?(Элементы.НомерКомнатыОтель.Видимость, 8, 0);

	Элементы.ДекорацияРастяжкаКнопок.МаксимальнаяШирина = 34;
	Элементы.ДекорацияРастяжкаКнопок.МаксимальнаяШирина = Элементы.ДекорацияРастяжкаКнопок.МаксимальнаяШирина -?(Элементы.КнопкаЗарегистрироватьОбращение.Видимость,10,0); ;

	//Выставляем, обновляем штрафы!
	Если ЗначениеЗаполнено(ТекущийКлиент)
		И (НЕ ИспользоватьКлючи ИЛИ ТекущийКлиент = ТекущийКлюч.ЗанятКлиентом) Тогда
		
		// ++ LZRV - ЗАКОММЕНТИРОВАНО
		//Обработки.РабочийСтол.ВыставитьШтрафКлиенту(ТекущийКлиент, ТекущийКлюч, ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
		// ++ LZRV - ЗАКОММЕНТИРОВАНО
		
	КонецЕсли;

	Если Не ЭтотОбъект.ТекущийКлиент.ОбезличенныйКлиент Тогда

		//Обновляем надпись Последнее посещение
		Элементы.ДекорацияПоследнееПосещение.Заголовок = Документы.Посещение.ВернутьНадписьПоследнееПосещение(ТекущийКлиент, ТекущаяСтруктурнаяЕдиница);
		КлассификацияКонтактов.ОбновитьОблакоТегов(ЭтаФорма, ЭтотОбъект.ТекущийКлиент, Ложь, Истина);
		ОбновитьОблакоЗаметок();

		Элементы.ДекорацияБлокировкаОнлайнЗаписи.Заголовок = РегистрыСведений.БлокировкаОнлайнЗаписи.ВернутьНадписьОкончанияБлокировкиКлиента(ТекущийКлиент);
		Элементы.ГруппаБлокировкаОнлайнЗаписи.Видимость = ЗначениеЗаполнено(Элементы.ДекорацияБлокировкаОнлайнЗаписи.Заголовок); 

	КонецЕсли;

КонецПроцедуры
