Функция НайтиСопровождаемых(Сопровождающий) Экспорт
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РодственныеСвязи.Родственник КАК Родственник
		|ИЗ
		|	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
		|ГДЕ
		|	РодственныеСвязи.Контрагент = &Сопровождающий 
		|	И НЕ РодственныеСвязи.Родственник.ПометкаУдаления
		|	
		|	И (РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Сын%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Дочь%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Внук%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Внучка%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Племянник%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Племянница%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Подопечная%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Подопечный%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Брат%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Сестра%"")
		//++ ЗМВ 23.05.2025
		|	И РодственныеСвязи.ЗаконныйПредставитель
		//-- ЗМВ 23.05.2025
		|";
		
	Запрос = Новый Запрос(ТекстЗапроса); 	
	
	Запрос.УстановитьПараметр("Сопровождающий", Сопровождающий); 	
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	МассивДанных = Новый Массив;
	
	Для Каждого Строка Из Выгрузка Цикл
		 МассивДанных.Добавить(Строка.Родственник.Ссылка);
	КонецЦикла;
	
	Возврат МассивДанных;
		
КонецФункции

Функция НайтиЧленстваСопровождаемых(Сопровождаемый) Экспорт
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг КАК ЧленствоПакетУслуг
		|ИЗ
		|	РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
		|ГДЕ 
		|	ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг.Контрагент = &Сопровождаемый
		|	И ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг.Проведен
		|	И НЕ ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг.ПометкаУдаления
		|	И ЧленстваПакетыУслугИтоги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
		|	И ЧленстваПакетыУслугИтоги.СрокДействия >= &ТекущаяДата	
		|";

	Запрос = Новый Запрос(ТекстЗапроса); 	
	
	Запрос.УстановитьПараметр("Сопровождаемый", Сопровождаемый); 	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	МассивДанных = Новый Массив;
	
	Для Каждого Строка Из Выгрузка Цикл
		 МассивДанных.Добавить(Строка.ЧленствоПакетУслуг.Ссылка);
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

//

Функция ПроверитьЧленствоНаВозможностьПрохода(Членство, ЭтоВход) Экспорт
	

	
	ТаблицаВремяДействия	= Новый ТаблицаЗначений;
	СтрокаЧленство			= Членство;
	СтруктурнаяЕдиница      = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
	// Актуализируем часовой пояс исходя из структурной единицы
	ЧасовойПоясТекущегоСеанса = ЧасовойПоясСеанса();
	ЧасовойПоясСЕ = СтруктурнаяЕдиница.ЧасовойПояс;
	Дата = ТекущаяДатаСеанса();
	Если ЧасовойПоясТекущегоСеанса <> ЧасовойПоясСЕ Тогда 
		УстановитьЧасовойПоясСеанса(ЧасовойПоясСЕ);
		Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	ДатаПрохода				= Дата;
	МассивДоступа			= Новый Массив;
	
	ТекущаяДата				= НачалоДня(ДатаПрохода);
	ТекущееВремя			= Дата(1,1,1,Час(ДатаПрохода),Минута(ДатаПрохода),00);
	ДеньНедели				= ДеньНедели(ТекущаяДата);
	ЭтоПраздничныйДень		= ОбщегоНазначения.ЭтоПраздничныйДень(ТекущаяДата);
	ЭтоРабочийДень			= ОбщегоНазначения.ЭтоРабочийДень(ТекущаяДата);
	ВремяПереодеванияДо		= Константы.ВремяПереодеванияДоЗанятия.Получить() * 60 + 60;
	ВремяПереодеванияПосле	= Константы.ВремяПереодеванияПослеЗанятия.Получить() * 60 + 60;
	
	МассивВремениРаботы = ВремяРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница, ДеньНедели, ДатаПрохода, ЭтоПраздничныйДень);
	
	Если СтрокаЧленство.ОграниченияПоВремениДействияИзменены ИЛИ СтрокаЧленство.ВремяДействия.Количество() > 0 Тогда
		ОграничениеПоВремениДействия = СтрокаЧленство.ОграничениеПоВремениДействия;
		ТаблицаВремяДействия 		 = СтрокаЧленство.ВремяДействия;
	Иначе
		ОграничениеПоВремениДействия = СтрокаЧленство.Номенклатура.ЧленствоПакетУслугОграничениеПоВремениДействия;
		ТаблицаВремяДействия 		 = СтрокаЧленство.Номенклатура.ЧленствоПакетУслугВремяДействия;
	КонецЕсли;
	
	Если ОграничениеПоВремениДействия = Перечисления.ТипыОграниченийЧленствПакетовУслуг.ВремяОграничено Тогда   //TODO
		Для Каждого СтрокаТЧ Из ТаблицаВремяДействия Цикл
			
			Если ПроверкаОграниченияПоДнямНедели(СтрокаТЧ.ДеньНедели, ТекущаяДата, ЭтоРабочийДень) Тогда
				
				// Если Время начало больше времени конца, значит время конца другой день.
				// 01.01.0001 09:00 и 01.01.0001 02:00 и надо перекинуть на другой день.
				ВремяПо = ?(СтрокаТЧ.ВремяС > СтрокаТЧ.ВремяПо, СтрокаТЧ.ВремяПо + 86400, СтрокаТЧ.ВремяПо);
				
				// Проверяем предыдущий день, в том случае если стуктурка работает после 24 часов.
				Если МассивВремениРаботы.Количество() > 1 Тогда
					ПредыдущийДеньРабочий = ОбщегоНазначения.ЭтоРабочийДень(ТекущаяДата - 1);
					Если ПроверкаОграниченияПоДнямНедели(СтрокаТЧ.ДеньНедели, ТекущаяДата - 1, ПредыдущийДеньРабочий) И День(ВремяПо) = 2 Тогда
						
						// Если время окончания работы клуба меньше чем указано в членстве, проводим корректировку.
						Если МассивВремениРаботы[0].ОкончаниеРаботы > (Дата(1,1,1) + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) Тогда
							ВремяКонца  = (ТекущаяДата + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) + ВремяПереодеванияПосле; 			
						Иначе
							ВремяКонца  = (ТекущаяДата + Час(МассивВремениРаботы[0].ОкончаниеРаботы) * 3600 + Минута(МассивВремениРаботы[0].ОкончаниеРаботы) * 60) + ВремяПереодеванияПосле;
						КонецЕсли;
						
						МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
						СтрокаЧленство.ЧленствоПакетУслуг, ТекущаяДата, ВремяКонца, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));							
					КонецЕсли;
				Иначе
					// Проверим на время окончания работы клуба.
					Если НЕ МассивВремениРаботы[0].ОкончаниеРаботы = Дата(1,1,1, 23,59,59)
						И МассивВремениРаботы[0].ОкончаниеРаботы < ВремяПо Тогда
						ВремяПо = МассивВремениРаботы[0].ОкончаниеРаботы;							
					КонецЕсли;		
					
				КонецЕсли;
				
				// Проверим на время начала работы клуба.
				Если МассивВремениРаботы[0].НачалоРаботы > СтрокаТЧ.ВремяС Тогда
					ВремяС = МассивВремениРаботы[0].НачалоРаботы;
					ВремяНачало = (ТекущаяДата + Час(ВремяС) * 3600 + Минута(ВремяС) * 60)
				Иначе
					ВремяНачало = (ТекущаяДата + Час(СтрокаТЧ.ВремяС) * 3600 + Минута(СтрокаТЧ.ВремяС) * 60) - ВремяПереодеванияДо;
				КонецЕсли; 									
				
				Если День(ВремяПо) = 2 Тогда                                                                                           						 
					ВремяКонца = КонецДня(ТекущаяДата);
				Иначе
					ВремяКонца = (ТекущаяДата + Час(СтрокаТЧ.ВремяПо) * 3600 + Минута(СтрокаТЧ.ВремяПо) * 60) + ВремяПереодеванияПосле;						
				КонецЕсли;
				
				// ++ ЛазаревАА (Добавлена проверка на время работы клуба)
				// Проверим на время начала работы клуба.
				ВремяНачалоРаботы = МассивВремениРаботы[0].НачалоРаботы;
				Если Час(ВремяНачалоРаботы) > Час(ВремяНачало) Тогда
					ВремяНачало = (ТекущаяДата + Час(ВремяНачалоРаботы) * 3600 + Минута(ВремяНачалоРаботы) * 60)
				КонецЕсли; 
				// -- ЛазаревАА (Добавлена проверка на время работы клуба)
				
				МассивДоступа.Добавить(Новый Структура("ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, Приоритет, ТребуетсяМедСправка",
				СтрокаЧленство.ЧленствоПакетУслуг, ВремяНачало, ВремяКонца, СтрокаЧленство.Приоритет, СтрокаЧленство.ТребуетсяМедСправка));
				
			КонецЕсли; 
		КонецЦикла;
	Иначе 			
		Для Каждого СтрокаМ Из МассивВремениРаботы Цикл
			ВремяНачалоЧленство = НачалоДня(ТекущаяДата) + Час(СтрокаМ.НачалоРаботы)    * 3600 + Минута(СтрокаМ.НачалоРаботы)    * 60 + Секунда(СтрокаМ.НачалоРаботы); 
			ВремяКонцаЧленство  = НачалоДня(ТекущаяДата) + Час(СтрокаМ.ОкончаниеРаботы) * 3600 + Минута(СтрокаМ.ОкончаниеРаботы) * 60 + Секунда(СтрокаМ.ОкончаниеРаботы);				
			Если ДатаПрохода > ВремяНачалоЧленство И ДатаПрохода < ВремяКонцаЧленство Тогда
				Возврат Истина;
			КонецЕсли			
		КонецЦикла;
	КонецЕсли;
		
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьПакетУслугНаВозможностьПрохода(ПакетУслуг, ЭтоВход) Экспорт
	
	Клиент = ПакетУслуг.Контрагент;
	ДатаСреза = ТекущаяДата();
	
	ТаблицаВремяДействия	= Новый ТаблицаЗначений;
	СтрокаПакетУслуг		= ПакетУслуг;
	СтруктурнаяЕдиница      = ПакетУслуг.СтруктурнаяЕдиница;
	
	// Актуализируем часовой пояс исходя из структурной единицы
	ЧасовойПоясТекущегоСеанса = ЧасовойПоясСеанса();
	ЧасовойПоясСЕ = СтруктурнаяЕдиница.ЧасовойПояс;
	Дата = ТекущаяДатаСеанса();
	Если ЧасовойПоясТекущегоСеанса <> ЧасовойПоясСЕ Тогда 
		УстановитьЧасовойПоясСеанса(ЧасовойПоясСЕ);
		Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	ДатаПрохода				= Дата;
	МассивДоступа			= Новый Массив;
	
	ТекущаяДата				= НачалоДня(ДатаПрохода);
	ТекущееВремя			= Дата(1, 1, 1, Час(ДатаПрохода), Минута(ДатаПрохода), 00);
	ДеньНедели				= ДеньНедели(ТекущаяДата);
	ЭтоПраздничныйДень		= ОбщегоНазначения.ЭтоПраздничныйДень(ТекущаяДата);
	ЭтоРабочийДень			= ОбщегоНазначения.ЭтоРабочийДень(ТекущаяДата);
	ВремяПереодеванияДо		= Константы.ВремяПереодеванияДоЗанятия.Получить() * 60 + 60;
	ВремяПереодеванияПосле	= Константы.ВремяПереодеванияПослеЗанятия.Получить() * 60 + 60;
	
	МассивВремениРаботы = ВремяРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница, ДеньНедели, ДатаПрохода, ЭтоПраздничныйДень);
	
	Если НачалоДня(ТекущаяДата - ВремяПереодеванияПосле) < НачалоДня(ТекущаяДата) Тогда
		ДатаСреза = ТекущаяДата;
	Иначе
		ДатаСреза = ТекущаяДата - ВремяПереодеванияПосле
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = PocketKey_ПолучитьТекстЗапросаЗанятийПоПомещениям();	
	Запрос.УстановитьПараметр("Клиент" , Клиент);
	Запрос.УстановитьПараметр("Дата"   , ДатаСреза);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
			
	ТаблицаЗанятий = Запрос.Выполнить().Выгрузить();
	
	ПроходРазрешен = Ложь;
	
	Для Каждого СтрокаТЧ из ТаблицаЗанятий Цикл
		
		ВремяПереодеванияДо		= Константы.ВремяПереодеванияДоЗанятия.Получить() * 60;
		ВремяПереодеванияПосле	= Константы.ВремяПереодеванияПослеЗанятия.Получить() * 60;
		ВремяНачало 			= СтрокаТЧ.ВремяНачало - ВремяПереодеванияДо;
		ВремяКонца  			= СтрокаТЧ.ВремяКонца + ВремяПереодеванияПосле;
		
		Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЧ.Услуга, 1) Тогда
			ВремяНачало			= СтрокаТЧ.ВремяНачало - (60*60); //60 мин 
			ВремяКонца			= СтрокаТЧ.ВремяКонца + (2*60*60); //добавим 2 часа 
		КонецЕсли;		
		
		Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЧ.Услуга, 2) Тогда
			ВремяНачало			= СтрокаТЧ.ВремяНачало - (30*60); //30 мин 
			ВремяКонца			= СтрокаТЧ.ВремяКонца + (30*60); //30 мин
		КонецЕсли;	
		
		Если ЭтоВход Тогда
			ПроходРазрешен		= ДатаПрохода > ВремяНачало;
		Иначе
			ПроходРазрешен		= ДатаПрохода < ВремяКонца;
		КонецЕсли;
		
		Если ПроходРазрешен Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция НайтиЗаписьНаЗанятие(Клиент, Карта, ДатаПрохода, Вход, СтруктурнаяЕдиница, СтрокаТЧ) Экспорт
	
	ВремяПереодеванияДо		= Константы.ВремяПереодеванияДоЗанятия.Получить() * 60;
	ВремяПереодеванияПосле	= Константы.ВремяПереодеванияПослеЗанятия.Получить() * 60;
	
	ТекущаяДата = НачалоДня(ДатаПрохода);
	Если НачалоДня(ТекущаяДата - ВремяПереодеванияПосле) < НачалоДня(ТекущаяДата) Тогда
		ДатаСреза = ТекущаяДата;
	Иначе
		ДатаСреза = ТекущаяДата - ВремяПереодеванияПосле
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = PocketKey_ПолучитьТекстЗапросаЗанятийПоПомещениям();	
	Запрос.УстановитьПараметр("Клиент"				, Клиент);
	Запрос.УстановитьПараметр("Дата"				, ДатаСреза);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);	
	
	ТаблицаЗанятий = Запрос.Выполнить().Выгрузить();
	
	ПроходРазрешен = Ложь;
	
	Для Каждого СтрокаТЗ из ТаблицаЗанятий Цикл
		
		ВремяНачало 			= СтрокаТЗ.ВремяНачало - ВремяПереодеванияДо;
		ВремяКонца  			= СтрокаТЗ.ВремяКонца + ВремяПереодеванияПосле;
		
		Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЗ.Услуга, 1) Тогда
			ВремяНачало			= СтрокаТЗ.ВремяНачало - (60*60); //30 мин 
			ВремяКонца			= СтрокаТЗ.ВремяКонца + (2*60*60); //добавим 3 часа 
		КонецЕсли;		
		
		Если PocketKey_Модуль.PocketKey_УслугаЗанятияВСегментеДобавленияВремени(СтрокаТЗ.Услуга, 2) Тогда
			ВремяНачало			= СтрокаТЗ.ВремяНачало - (30*60); //30 мин 
			ВремяКонца			= СтрокаТЗ.ВремяКонца + (30*60); //30 мин
		КонецЕсли;	
		
		Если Вход Тогда
			ПроходРазрешен		= ДатаПрохода > ВремяНачало;
		Иначе
			ПроходРазрешен		= ДатаПрохода < ВремяКонца;
		КонецЕсли;
		
		Если ПроходРазрешен Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;	
	
КонецФункции

//

Функция ВыполнитьПроверкуСопровождения(Сопровождающий) Экспорт
	
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг КАК ЧПУ
		|ИЗ
		|	РегистрСведений.РодственныеСвязи КАК РодственныеСвязи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧленстваПакетыУслугИтоги КАК ЧленстваПакетыУслугИтоги
		|		ПО РодственныеСвязи.Родственник = ЧленстваПакетыУслугИтоги.ЧленствоПакетУслуг.Контрагент
		|ГДЕ
		|	РодственныеСвязи.Контрагент = &Сопровождающий
		|	И НЕ РодственныеСвязи.Контрагент.ПометкаУдаления
		|	И НЕ РодственныеСвязи.Родственник.ПометкаУдаления
		|	И ЧленстваПакетыУслугИтоги.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленствПакетовУслуг.Активен)
		|	И ЧленстваПакетыУслугИтоги.СрокДействия >= &ТекущаяДата
		|	
		|	И (РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Сын%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Дочь%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Внук%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Внучка%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Племянник%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Племянница%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Подопечная%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Подопечный%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Брат%""
		|		ИЛИ РодственныеСвязи.СтепеньРодства.Наименование ПОДОБНО ""%Сестра%"")
		|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Сопровождающий"	, Сопровождающий);
	Запрос.УстановитьПараметр("ТекущаяДата"		, НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка Из Выгрузка Цикл
		
		Возврат Истина;
		
		ЧПУРодственника = Строка.ЧПУ;	
		
	КонецЦикла;
	
КонецФункции

Функция PocketKey_ПолучитьТекстЗапросаЗанятийПоПомещениям()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗанятиеСоставЗанятия.Ссылка КАК Занятие,
	|	ЗанятиеСоставЗанятия.Контрагент КАК Контрагент,
	|	ЗанятиеСоставЗанятия.ОснованиеОплаты КАК ОснованиеОплаты,
	|	ЗанятиеСоставЗанятия.ДатаБронирования КАК ДатаБронирования
	|ПОМЕСТИТЬ ТаблицаСоставаЗанятия
	|ИЗ
	|	Документ.Занятие.СоставЗанятия КАК ЗанятиеСоставЗанятия
	|ГДЕ
	|	ЗанятиеСоставЗанятия.Контрагент = &Клиент
	|	И НЕ ЗанятиеСоставЗанятия.СтатусПрибытия = 2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаписьНаЗанятие.Занятие,
	|	ЗаписьНаЗанятие.Контрагент,
	|	ЗаписьНаЗанятие.ОснованиеОплаты,
	|	ЗаписьНаЗанятие.ДатаБронирования
	|ИЗ
	|	Документ.ЗаписьНаЗанятие КАК ЗаписьНаЗанятие
	|ГДЕ
	|	ЗаписьНаЗанятие.Проведен
	|	И ЗаписьНаЗанятие.Контрагент = &Клиент
	|	И НЕ ЗаписьНаЗанятие.СтатусПрибытия = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаСоставаЗанятия.ОснованиеОплаты = НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаСоставаЗанятия.Занятие
	|		ИНАЧЕ ТаблицаСоставаЗанятия.ОснованиеОплаты
	|	КОНЕЦ КАК ЧленствоПакетУслуг,
	|	ДокументЗанятие.Дата КАК ВремяНачало,
	|	ДокументЗанятие.ДатаВремяОкончания КАК ВремяКонца,
	|	ДокументЗанятие.Помещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСоставаЗанятия.ОснованиеОплаты = НЕОПРЕДЕЛЕНО
	|				И ТаблицаСоставаЗанятия.ОснованиеОплаты ССЫЛКА Документ.ЧленствоПакетУслуг
	|			ТОГДА ТаблицаСоставаЗанятия.ОснованиеОплаты.Номенклатура.ТребНалМедСправки
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребуетсяМедСправка,
	|	ТаблицаСоставаЗанятия.ДатаБронирования КАК ДатаБронирования,
	|	ТаблицаСоставаЗанятия.ОснованиеОплаты КАК ОснованиеОплаты,
	|	4 КАК Приоритет,
	|	ТаблицаСоставаЗанятия.ОснованиеОплаты.Номенклатура.ЧленствоПакетУслугОграничениеПоПомещениям КАК ОграничениеПоПомещениям,
	|	ТаблицаСоставаЗанятия.ОснованиеОплаты.ДоступКПомещениям.(
	|		Ссылка КАК Поле1,
	|		НомерСтроки КАК Поле2,
	|		Помещение КАК Поле3
	|	) КАК ДоступКПомещениям,
	
	// ++ ЛАА
	|	ДокументЗанятие.Ссылка.Номенклатура КАК Услуга
	// -- ЛАА 
	
	|ИЗ
	|	ТаблицаСоставаЗанятия КАК ТаблицаСоставаЗанятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Занятие КАК ДокументЗанятие
	|		ПО ТаблицаСоставаЗанятия.Занятие = ДокументЗанятие.Ссылка
	|ГДЕ
	|	ДокументЗанятие.ДатаВремяОкончания > &Дата
	|	И (ДокументЗанятие.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Запланировано)
	|			ИЛИ ДокументЗанятие.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Проводится)
	|			ИЛИ ДокументЗанятие.СтатусЗанятия = ЗНАЧЕНИЕ(Перечисление.СтатусыЗанятия.Проведено))
	|	И ДокументЗанятие.Проведен
	|	И (НАЧАЛОПЕРИОДА(ДокументЗанятие.ДатаВремяОкончания, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ИЛИ НАЧАЛОПЕРИОДА(ДокументЗанятие.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))
	|	И ДокументЗанятие.СтруктурнаяЕдиница = &СтруктурнаяЕдиница"; 
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция, возвращает интервалы работы структурной единицы.
//
Функция ВремяРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница, ДеньНедели, Дата, ЭтоПраздничныйДень) Экспорт
		
	МассивРасписанияРаботы = Новый Массив;
	
	Если СтруктурнаяЕдиница.РасписаниеРаботы.Количество() < 8 Тогда
		
		СтруктураВремени = Новый Структура;
		СтруктураВремени.Вставить("НачалоРаботы"   , Дата(1,1,1,00,00,00));
		СтруктураВремени.Вставить("ОкончаниеРаботы", Дата(1,1,1,23,59,59));		
		
		МассивРасписанияРаботы.Добавить(СтруктураВремени);
		
		Возврат МассивРасписанияРаботы;
		
	КонецЕсли;
	
	ИндексТекущегоДня = ДеньНедели - 1;
	
	// Если понедельник, то предыдущий день - воскресенье
	Если ДеньНедели = 1 Тогда
		// 1. Определяем индекс дня недели предыдущего дня с учетом праздничного дня.
		ИндексПредыдущегоДеня = ?(ОбщегоНазначения.ЭтоПраздничныйДень(НачалоДня(Дата) - 1), 6, 6);
	Иначе
		// 1. Определяем индекс дня недели предыдущего дня с учетом праздничного дня.
		ИндексПредыдущегоДеня = ?(ОбщегоНазначения.ЭтоПраздничныйДень(НачалоДня(Дата) - 1), 6, ИндексТекущегоДня - 1);
	КонецЕсли;
	
	ВремяРаботыПредыдущегоДня = СтруктурнаяЕдиница.РасписаниеРаботы[ИндексПредыдущегоДеня];
	
	// Для работы с переходом на другой день проверяем предыдущий день.
	// Если сегодня к примеру среда, то мы должны проверить в графике
	// не работает ли клуб во вторник после 24:00
	Если ВремяРаботыПредыдущегоДня.Активность И День(ВремяРаботыПредыдущегоДня.ОкончаниеРаботы) = 2 
		И НЕ ВремяРаботыПредыдущегоДня.ОкончаниеРаботы = Дата(1,1,2) Тогда
		
		СтруктураВремени = Новый Структура;
		СтруктураВремени.Вставить("НачалоРаботы"   , Дата(01,01,01));
		СтруктураВремени.Вставить("ОкончаниеРаботы", Дата(01,01,01) + Час(ВремяРаботыПредыдущегоДня.ОкончаниеРаботы) * 3600 + Минута(ВремяРаботыПредыдущегоДня.ОкончаниеРаботы) * 60);			
		
		МассивРасписанияРаботы.Добавить(СтруктураВремени);
		
	КонецЕсли;
	
	ИндексТекущегоДня      = ?(ЭтоПраздничныйДень, 6, ИндексТекущегоДня);	
	ВремяРаботыТекущегоДня = СтруктурнаяЕдиница.РасписаниеРаботы[ИндексТекущегоДня];
	
	Если ВремяРаботыТекущегоДня.Активность Тогда
		
		СтруктураВремени = Новый Структура;
		СтруктураВремени.Вставить("НачалоРаботы"   , ВремяРаботыТекущегоДня.НачалоРаботы);
		СтруктураВремени.Вставить("ОкончаниеРаботы", ?(День(ВремяРаботыТекущегоДня.ОкончаниеРаботы) = 2, Дата(1,1,1,23,59,59), ВремяРаботыТекущегоДня.ОкончаниеРаботы));
		
		МассивРасписанияРаботы.Добавить(СтруктураВремени);	
	
	КонецЕсли;
	
	Возврат МассивРасписанияРаботы;
	
КонецФункции

// Функция, возвращает признак органичения по дням недели.
//
Функция ПроверкаОграниченияПоДнямНедели(ДеньОграничения, Дата, ЭтоРабочийДень)
	
	Возврат Документы.ЧленствоПакетУслуг.ОграничениеВремениДействияЧПУВключаетВыбраннуюДату(ДеньОграничения, Дата, ЭтоРабочийДень);
	
КонецФункции
