&Вместо("GetAccessGET")
// Функция, возвращает разрешение на проход.
//
Функция PocketKey_GetAccessGET(Запрос)
	                                             
	УстановитьПривилегированныйРежим(Истина);
	
	ИдУстройства    = Запрос.ПараметрыЗапроса.Получить("id");
	КодКарты        = Запрос.ПараметрыЗапроса.Получить("uid");
	ДанныеШкафчиков = Запрос.ПараметрыЗапроса.Получить("cells");
	Дата            = ТекущаяДатаСеанса();
	
	#Область Логирование_Добавлено
	//++ЛАА
	ТекстЛог = СтрШаблон("ИдУстройства: %1 | КодКарты: %2 | ДанныеШкафчиков: %3 ", ИдУстройства, КодКарты, ДанныеШкафчиков);
	ЗаписьЖурналаРегистрации("ТерФит. ПокетКей. GetAccessGET", УровеньЖурналаРегистрации.Информация,,, ТекстЛог);	
	//--ЛАА          
	#КонецОбласти

	
	//++ЛАА
	КодКарты = ВРег(КодКарты);
	ЭтоТест = Ложь;
	Если КодКарты = "000AA000" Тогда
		ЭтоТест = Истина;
		ДатаВремя = Запрос.ПараметрыЗапроса.Получить("datatime");
		Дата = Дата(ДатаВремя);
	КонецЕсли;
	//--ЛАА

	ОбработчикДрайвера   = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСКУДPocketkey_КОРП;
	ПараметрыПодключения = МенеджерОборудованияСКУД_КОРП.ПолучитьПараметрыПодключенияСКУД(ОбработчикДрайвера);

	Если ПараметрыПодключения = Неопределено Тогда
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(Неопределено, Дата, 1, КодКарты,, ИдУстройства,,,"Не заданы настройки СКУД!");
		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Не заданы;настройки СКУД", "");
	КонецЕсли;

	ЭтоВход                   = Неопределено;
	СтруктурнаяЕдиница        = Неопределено;
	МассивПомещений           = Неопределено;
	НомерШкафчика             = 0; 
	КонвертироватьКодКарты    = НЕ ПараметрыПодключения.НеКонвертироватьКодКарты;
	КодШкафчиков              = ?(ПараметрыПодключения.Свойство("КодШкафчиков"), ПараметрыПодключения.КодШкафчиков, "62"); 
	КодСейфов                 = ?(ПараметрыПодключения.Свойство("КодСейфов")   , ПараметрыПодключения.КодСейфов   , "33"); 
	СинхронизацияКлиента      = ?(ПараметрыПодключения.Свойство("СинхронизацияКлиента"), ПараметрыПодключения.СинхронизацияКлиента, Ложь);
	МенятьБайтыМестами        = ?(ПараметрыПодключения.Свойство("МенятьБайтыМестами")  , ПараметрыПодключения.МенятьБайтыМестами  , Ложь);
	НеСоздаватьНовоеПосещение = ?(ПараметрыПодключения.Свойство("НеСоздаватьНовоеПосещение"), ПараметрыПодключения.НеСоздаватьНовоеПосещение, 0);
	ТребуетсяМедСправка       = Ложь;
	Камера					  = Неопределено;
	ВремяБлокировки           = ?(ПараметрыПодключения.Свойство("ВремяБлокировкиПрикладыванияКарты"), ПараметрыПодключения.ВремяБлокировкиПрикладыванияКарты, 0);
	//ДоступFaceID              = ПараметрыПодключения.Свойство("ДоступFaceID") И ПараметрыПодключения.ДоступFaceID;
	// Face ID определяется по передаваемому префиксу в коде карты F:

	Если СтрНайти(КодКарты, "F:") > 0 Тогда
		ДоступFaceID = Истина;
		КодКарты = СтрЗаменить(КодКарты, "F:", "");		
	Иначе
		ДоступFaceID = Ложь;		
	КонецЕсли;  

	РегистироватьПроход = Ложь;
	Для Каждого ТочкаДоступа из ПараметрыПодключения.ТаблицаТочекДоступа Цикл
		Если Формат(ТочкаДоступа.КлючСтроки, "ЧГ=") = Строка(ИдУстройства) Тогда
			ЭтоВход				     = ТочкаДоступа.Направление;		// 0 - выход, 1 - вход, 
			МассивПомещений     	 = ТочкаДоступа.СписокПомещений; 	// Если массив пустой, то ограничений нет.
			СтруктурнаяЕдиница  	 = ТочкаДоступа.СтруктурнаяЕдиница;
			РегистироватьПроход 	 = ТочкаДоступа.РегистрироватьПроход;			
			ТребуетсяМедСправка      = ?(ТочкаДоступа.Свойство("ТребуетсяМедСправка"), ТочкаДоступа.ТребуетсяМедСправка , Ложь);
			Камера			         = ?(ТочкаДоступа.Свойство("Камера")			 , ТочкаДоступа.Камера				, Неопределено);
			НаименованиеУстройства   = ТочкаДоступа.ТочкаДоступа;
		КонецЕсли;
	КонецЦикла;	

	// Если не заполнена структурная единица, то возвращаем ошибку.
	Если СтруктурнаяЕдиница = Неопределено Тогда
		Описание = "Не заданы параметры контроллера в настройках СКУД!";
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,,ИдУстройства,,, Описание);

		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Не заданы;параметры;контроллера;в настройках;СКУД!", "");
	КонецЕсли;

	// Актуализируем часовой пояс исходя из структурной единицы
	ЧасовойПоясТекущегоСеанса = ЧасовойПоясСеанса();
	ЧасовойПоясСЕ = СтруктурнаяЕдиница.ЧасовойПояс;
	Если ЧасовойПоясТекущегоСеанса <> ЧасовойПоясСЕ Тогда 
		УстановитьЧасовойПоясСеанса(ЧасовойПоясСЕ);
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;  

	// Если доступ без карт.
	Если ДоступFaceID Тогда

		Попытка
			// Ищем клиента по коду карты, как есть
			Если СинхронизацияКлиента Тогда

				КодКарты = Сред(КодКарты, 2);			
				ДанныеКарты = Справочники.Карты.ПолучитьДанныеМагнитнойКартыКлюча(КодКарты);			

			Иначе
				// Ищем клиента по коду справочника. 
				ДанныеКарты = PocketKey_Модуль.PocketKey_ПолучитьДанныеКартыПоКодуБиометрии(КодКарты);

			КонецЕсли;		
		Исключение
			Описание = "Ошибка поиска по Face ID!"; 
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Ошибка;поиска по;Face ID!", "");	

		КонецПопытки;
	Иначе
		Если КонвертироватьКодКарты Тогда  // Конвертируем код карты.
			Попытка
				КодКарты = PocketKey_Модуль.PocketKey_КонвертироватьКодКарты(КодКарты);
			Исключение			                                                                       		
				Описание = "Ошибка конвертации карты!"; 
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

				Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Ошибка;конвертации;карты!", "");
			КонецПопытки;
		ИначеЕсли МенятьБайтыМестами Тогда
			Попытка
				КодКарты = Сред(КодКарты, 7) + Сред(КодКарты, 1, 6);
			Исключение
				Описание = "Ошибка конвертации карты! Менять байты местами!"; 
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

				Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Ошибка;конвертации;карты!", "");
			КонецПопытки;
		КонецЕсли; 	

		// Получаем данные карты.
		ДанныеКарты = Справочники.Карты.ПолучитьДанныеМагнитнойКартыКлюча(КодКарты);

	КонецЕсли;

	Если ДанныеКарты = Неопределено Тогда
		Описание = "Доступ запрещен, неизвестный код карты";
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;неизвестный;код карты", "");

	ИначеЕсли Не ЗначениеЗаполнено(ДанныеКарты.ВладелецКарты) Тогда
		Описание = "Доступ запрещен, карта не привязана к клиенту";
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;карта;не привязана;к клиенту", "");	

	ИначеЕсли ДанныеКарты.Заблокирована ИЛИ ДанныеКарты.ПометкаУдаления Тогда

		Описание = "Доступ запрещен, карта заблокирована";
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;карта;заблокирована", "");

	КонецЕсли;
	
	#Область РаспознаваниеЛица_Закомментировано
	
	//// Распознавание лица
	//Если ЗначениеЗаполнено(Камера) И НЕ ДанныеКарты.НеИспользоватьБиометрию Тогда
	//	Если ДанныеКарты.ВладелецКарты.УИДСинхронизации = "" Тогда

	//		Описание = "Доступ запрещен, фото не загружено в сервис RecognitionX";
	//		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

	//		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;нет фото", "");

	//	КонецЕсли;

	//	idКамеры					 = Строка(Сред(Камера, СтрНайти(Камера, ";") + 2));
	//	ПараметрыПодключенияКСервису = ПолучитьПараметрыПодключенияКСервису(idКамеры);

	//	Если ПараметрыПодключенияКСервису = Неопределено Тогда

	//		Описание = "Не удалось получить параметры подключения к сервису RecognitionX";
	//		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

	//		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;Ошибка фото", "");

	//	КонецЕсли;

	//	ОписаниеОшибки = РаспознатьЛицоRX(ДанныеКарты.ВладелецКарты, idКамеры, ПараметрыПодключенияКСервису.Параметры);
	//	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда

	//		Описание = ОписаниеОшибки;
	//		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

	//		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;лицо не распознано", "");

	//	КонецЕсли;
	//КонецЕсли;
	
	#КонецОбласти

	ВладелецКартыСотрудник = (ТипЗнч(ДанныеКарты.ВладелецКарты) = Тип("СправочникСсылка.Сотрудники"));
	
	//++ ЗМВ 26.03.2025
	ПроверкаНеИспользоватьБиометрию = PocketKey_ПроверкаИспользованияБиометрии.ПроверкаНеИспользоватьБиометрию(ДанныеКарты.ВладелецКарты, ИдУстройства, СтруктурнаяЕдиница);
	//Получаем сегмент из отбора по ид устройства, если данные карты владелец есть в сегменте то отключаем биометрию.
 	Если ПроверкаНеИспользоватьБиометрию Тогда
		УИДВладельцаКарты = "";  
	//-- ЗМВ 26.03.2025	
	ИначеЕсли ДанныеКарты.НеИспользоватьБиометрию Тогда		
		УИДВладельцаКарты = "";
	ИначеЕсли СинхронизацияКлиента Тогда
		УИДВладельцаКарты = КодКарты;
	Иначе

		КодБиометрии = "";
		КодВладельца = СокрЛ(ДанныеКарты.КодВладельца);				
		Для К = 1 По СтрДлина(КодВладельца) Цикл
			Символ = Сред(КодВладельца, К, 1);
			Если Найти("0123456789", Символ) <> 0 Тогда
				КодБиометрии = КодБиометрии + Символ;
			КонецЕсли;
		КонецЦикла;			

		УИДВладельцаКарты = ?(ВладелецКартыСотрудник, "E", "C") + КодБиометрии;

	КонецЕсли;
	
	#Область Парковка_Добавлено
	
	Попытка
		ЭтоПарковка = ?(СтрНайти(ВРег(НаименованиеУстройства), "ПАРКОВКА") > 0, Истина, Ложь);
	Исключение
		ЭтоПарковка = Ложь;
	КонецПопытки;
	
	Если ЭтоПарковка Тогда
		
		Попытка
			
			НачатьТранзакцию();
			                                           
			Результат = PocketKey_Парковка.ПолучитьДоступПарковка(ДанныеКарты.ВладелецКарты, ДанныеКарты.Карта, Дата, ЭтоВход, СтруктурнаяЕдиница);
			
			Если Результат.Доступ Тогда		
				Описание = "Проезд разрешен";
				ОписаниеОтвета = "Проезд разрешен"; 
			ИначеЕсли ЗначениеЗаполнено(Результат.Описание) Тогда
				Описание = "Проезд запрещен, " + Результат.Описание;
				ОписаниеОтвета = "Проезд запрещен";
			Иначе
				Описание = "Проезд запрещен, у клиента нет доступных оснований";
				ОписаниеОтвета = "Проезд запрещен";
			КонецЕсли;  	
					
			ЗафиксироватьТранзакцию();
			
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 6, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание, Результат.Основание);
			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(Результат.Доступ, ОписаниеОтвета, УИДВладельцаКарты);
			
		Исключение
			
			//PocketKey_Модуль.ОтправитьОшибку(ОписаниеОшибки());
			
			Если Метаданные.ОбщиеМодули.Найти("ТФ_Телеграм") <> Неопределено Тогда
				ТФ_Телеграм.ОтправитьОшибку(ОписаниеОшибки());
			КонецЕсли;
			
			ОтменитьТранзакцию();
			
		КонецПопытки;
		
	КонецЕсли;
		
	#КонецОбласти

	НомерШкафчика = 0;

	Если НЕ ДанныеШкафчиков = Неопределено Тогда

		Шкафчики = PocketKey_Модуль.PocketKey_ПолучитьНомерШкафчикаИСейфа(ДанныеШкафчиков, КодШкафчиков, КодСейфов);	

		НомерШкафчика = Шкафчики.НомерШкафчика;
		НомерСейфа    = Шкафчики.НомерСейфа;

		Если ЗначениеЗаполнено(Шкафчики.ОписаниеОшибки) Тогда
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Шкафчики.ОписаниеОшибки);
		КонецЕсли;

	КонецЕсли;
	
	#Область ЗапретитьДвойнойПроход_Добавлено
	
	// ЗапретитьДвойнойПроход - Начало
	Если НЕ PocketKey_Исключения.PocketKey_ИсключитьИзПроверкиНаДвойнойПроход(ДанныеКарты.ВладелецКарты) Тогда 
		Если РегистироватьПроход И ПараметрыПодключения.ЗапретитьДвойнойПроход Тогда

			ПоследнийПроход = PocketKey_Модуль.PocketKey_ПолучитьПоследнийПроходВКлуб(ДанныеКарты.ВладелецКарты, КодКарты, ЭтоВход);
			//ПоследнийПроход = Ложь;
			Если ПоследнийПроход Тогда
				
				Если ЭтоВход Тогда
					Описание = "Доступ запрещен, повторный вход (terfit)";
					ОписаниеТерминал = "Доступ запрещен;повторный;вход"
				Иначе
					Описание = "Доступ запрещен, повторный выход (terfit)";
					ОписаниеТерминал = "Доступ запрещен;повторный;выход"
				КонецЕсли;
				
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);
				Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, ОписаниеТерминал, УИДВладельцаКарты);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// ЗапретитьДвойнойПроход - Конец
	
	#КонецОбласти

	#Область ЗапретитьДвойнойПроход_Закомментировано
	
	//ЗапретитьДвойнойПроходСотрудникам = ПараметрыПодключения.ЗапретитьДвойнойПроходСотрудникам;	

	//// Проверяем на двойной проход (antipassback).
	//Если РегистироватьПроход 
	//	И ((ВладелецКартыСотрудник И ЗапретитьДвойнойПроходСотрудникам)
	//	ИЛИ (НЕ ВладелецКартыСотрудник И ПараметрыПодключения.ЗапретитьДвойнойПроход)) Тогда		

	//	ПоследнийПроход = РегистрыСведений.ЖурналСобытийСКУД_КОРП.ПолучитьПоследнийПроходВКлуб(ДанныеКарты.ВладелецКарты, КодКарты, ЭтоВход);
	//	Если ПоследнийПроход Тогда
	//		Описание = "Доступ запрещен, повторный проход";
	//		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

	//		Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;повторный;проход", УИДВладельцаКарты);
	//	КонецЕсли;
	//КонецЕсли;
	
	#КонецОбласти
	
	#Область ДоступСотрудникаПоПомещениям_Добавлено	
	
	//++ЛАА
	КакСотрудник = PocketKey_Модуль.PocketKey_ПолучитьКакСотрудника(ДанныеКарты.ВладелецКарты);
	Если НЕ КакСотрудник = Неопределено И ЗначениеЗаполнено(КакСотрудник) 
		И НЕ МассивПомещений = Неопределено И ЗначениеЗаполнено(МассивПомещений) Тогда
			ДанныеКарты.ВладелецКарты = КакСотрудник;
			ВладелецКартыСотрудник = Истина;
	Иначе
			ВладелецКартыСотрудник = Ложь;
	КонецЕсли;	
	//--ЛАА
	
	#КонецОбласти
	
	Если ВладелецКартыСотрудник Тогда
		
		//++ ЗМВ 09.06.2025
	#Область ПроходыПомещенийРеутов2_Добавлено		
		//Система проходов в Реутов 2
		Если ВРег(СтруктурнаяЕдиница.Наименование) = ВРег("Реутов 2") Тогда
			
			Для каждого Строка Из МассивПомещений Цикл
				
				Если ВРег(Строка.Наименование) = ВРег("VIP STAFF") Тогда //Ограничения на проход в ВИП СТАФФ от наличия в сегменте сотрудников
					
					ЕстьДоступ = PocketKey_Проходы.СотрудникНаходитсяВСегменте_ДоступСотрудников_ВИП(КакСотрудник);
					Если ЕстьДоступ Тогда	
						Описание = "Доступ разрешен";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);
					Иначе 
						Описание = "Доступ запрещен, нет доступа к помещению";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);	
					КонецЕсли;
					
				ИначеЕсли ВРег(Строка.Наименование) = ВРег("VIP") Тогда    //Ограничения на проход в ВИП помещения от наличия в сегменте сотрудников 
					
					//++ ЗМВ 16.06.2025
					ЕстьДоступ = PocketKey_Проходы.СотрудникНаходитсяВСегменте_ДоступVIP_терминалы_ЧК(КакСотрудник);
					Если ЕстьДоступ Тогда
						Описание = "Доступ разрешен";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);
					Иначе
						Описание = "Доступ запрещен, нет доступа к помещению";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);
					КонецЕсли;
					//-- ЗМВ 16.06.2025
					
				ИначеЕсли ВРег(Строка.Наименование) = ВРег("СПА+УЛ.БАС") Тогда    //Ограничения на проход в СПА+УЛ.БАС от наличия в сегменте сотрудников
					
					ЕстьДоступ = PocketKey_Проходы.СотрудникНаходитсяВСегменте_ДоступСотрудников_СПА_УЛБАСС(КакСотрудник);
					Если ЕстьДоступ Тогда
						Описание = "Доступ разрешен";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);
					Иначе 
						Описание = "Доступ запрещен, нет доступа к помещению";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);		
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	#КонецОбласти		
		//-- ЗМВ 09.06.2025                                                   
		
		//++ ЗМВ 01.07.2025
	#Область ПроходыПомещений_КУРСК_Добавлено
		Если ВРег(СтруктурнаяЕдиница.Наименование) = ВРег("Курск") Тогда
			Для каждого Строка Из МассивПомещений Цикл	
				Если СтрНайти(ВРег(Строка.Наименование),ВРег("ВИП")) > 0 Тогда	
					ЕстьДоступ = PocketKey_Проходы.СотрудникНаходитсяВСегменте_ДоступСотрудников_ВИП(КакСотрудник);
					Если ЕстьДоступ Тогда
						Описание = "Доступ разрешен";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);	
					Иначе	
						Описание = "Доступ запрещен, нет доступа к помещению";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);		
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;			
		КонецЕсли;	
	#КонецОбласти
		//-- ЗМВ 01.07.2025

		// Проверяем доступ по помещениям.
		Если МенеджерОборудованияСКУД_КОРП.ПолучитьДоступСотрудникаПоПомещениям(ДанныеКарты.ВладелецКарты, МассивПомещений, Дата) = Истина Тогда

			Описание = "Доступ разрешен";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		

			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);
		Иначе
			Описание = "Доступ запрещен, нет доступа к помещению";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		

			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);			

		КонецЕсли;
                                 
	КонецЕсли;                                 
	
	#Область ДоступДляСотрудников_Добавлено
	
	//+ Трегубов В.Н. 11.01.2022 - Доступ для сотрудников
	Если ТипЗнч(ДанныеКарты.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты") Тогда
		ТаблицаЧленств = PocketKey_Модуль.PocketKey_ПолучитьТаблицуЧленств(СтруктурнаяЕдиница, ДанныеКарты.ВладелецКарты, Дата);
		
		Для Каждого СтрокаЧленство из ТаблицаЧленств Цикл
			
			//++ ЗМВ 10.06.2025
			#Область ПроходыПомещенийРеутов2_Добавлено
			//Система проходов в Реутов 2
			Если ВРег(СтруктурнаяЕдиница.Наименование) = ВРег("Реутов 2") Тогда
				
				ЕстьЧленствоВСегменте = PocketKey_Проходы.СегментНоменклатуры_СПА_УЛБАС(СтрокаЧленство.Номенклатура); 
				
				Для каждого Строка Из МассивПомещений Цикл
					
					Если ВРег(Строка.Наименование) = ВРег("VIP") Тогда    // Ограничение на проход в помещение "VIP" для ЧК у которых не номенклатура "Плюс"            
						
						Если СтрНайти(ВРег(СтрокаЧленство.Номенклатура.Наименование), "ПЛЮС") <> 0 Тогда	
							Описание = "Доступ разрешен";
							PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
							Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);
						Иначе 
							Описание = "Доступ запрещен, нет доступа к помещению";
							PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
							Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);	
						КонецЕсли;
						
					ИначеЕсли ВРег(Строка.Наименование) = ВРег("VIP STAFF") Тогда    // Запрет прохода в служебные помещения 
						
						Описание = "Доступ запрещен, нет доступа к помещению";
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);
						
					ИначеЕсли ВРег(Строка.Наименование) = ВРег("СПА+УЛ.БАС") Тогда // Ограничение на проход в помещение "СПА+УЛ.БАС" для ЧК у которых не номенклатура "Плюс"
						
						
					//++ ЗМВ 07.07.2025
						Для каждого Строка1 Из ТаблицаЧленств Цикл 
							
							ЕстьЧленствоВСегменте = PocketKey_Проходы.СегментНоменклатуры_СПА_УЛБАС(Строка1.Номенклатура); 
							
							Если СтрНайти(ВРег(Строка1.Номенклатура.Наименование), "ПЛЮС") <> 0 ИЛИ ЕстьЧленствоВСегменте Тогда 									
								Описание = "Доступ разрешен";
							Иначе									
								ТаблицаПакетовУслуг = PocketKey_Модуль.PocketKey_ПолучитьТаблицуПакетовУслуг(СтруктурнаяЕдиница, ДанныеКарты.ВладелецКарты, Дата);
								ТаблицаЗанятийСПА 	= PocketKey_Модуль.PocketKey_ПолучитьЗанятиеСПА();								
								Если ТаблицаПакетовУслуг.Количество() > 0 Тогда
									
									Для каждого СтрокаПакетаУслуг Из ТаблицаПакетовУслуг Цикл
										ЕстьПакетУслугВСегменте = PocketKey_Проходы.СегментНоменклатуры_СПА_УЛБАС(СтрокаПакетаУслуг.Номенклатура);
										//Если у клиента есть пакет услуг на проход в СПА тогда проверяем записан ли клиент, если клиент не записан, тогда мы записываем его и даем доступ	
										Если ЕстьПакетУслугВСегменте Тогда 

											ТаблицаОстатков 	= Документы.ЧленствоПакетУслуг.ПолучитьОстатокЧленстваПакетаУслугПоУслугам(СтрокаПакетаУслуг.ЧленствоПакетУслуг);
											ЕстьРезервЗанятий 	= PocketKey_Проходы.КоличестовУслугОстаток(ТаблицаОстатков);
											Если ЕстьРезервЗанятий Тогда	
										
												Для каждого Строка Из ТаблицаЗанятийСПА Цикл				
													
													КлиентЗаписан 			= PocketKey_Модуль.ЗаписанныйКлиентНаЗанятиеСПА(ДанныеКарты.ВладелецКарты, Строка.Ссылка);
													Если НЕ КлиентЗаписан Тогда

														ТаблицаОстатков 	= Документы.ЧленствоПакетУслуг.ПолучитьОстатокЧленстваПакетаУслугПоУслугам(СтрокаПакетаУслуг.ЧленствоПакетУслуг);
														ЕстьРезервЗанятий 	= PocketKey_Проходы.КоличестовУслугОстаток(ТаблицаОстатков);
														
														//Если у клиента остались услуги в пакете, тогда записываем на занятие и разрешаем доступ иначе отказ в доступе
														Если ЕстьРезервЗанятий Тогда	
															appointment_id 	= Строка.Ссылка.УникальныйИдентификатор(); 
															client_id 		= ДанныеКарты.ВладелецКарты.УникальныйИдентификатор();
															
															api_v2.PocketKey_post_group_appointment_terfit(client_id, appointment_id, СтруктурнаяЕдиница);  //Записываем на занятие
															
															Описание = "Доступ разрешен";							// Если у клиента есть остаток услуг для записи на занятие										
														Иначе
															Описание = "Доступ запрещен, нет доступа к помещению"; 	// Если у клиента нет остатка услуг для записи на занятие 
														КонецЕсли;	
													Иначе
														Описание = "Доступ разрешен"; 								// Если клиент уже записан на занятие повторный вход в помещение
													КонецЕсли;
												КонецЦикла; 													
											Иначе
												Описание = "Доступ запрещен, нет доступа к помещению"; 				// Если у клиента не осталось занятий 
											КонецЕсли;
										Иначе												
											Описание = "Доступ запрещен, нет доступа к помещению";					// Если у клиента есть пакет услуг, который находится в сегменте "ТК+УЛ.БАС"										
										КонецЕсли;										
									КонецЦикла;									
								Иначе		
									Описание = "Доступ запрещен, нет доступа к помещению"; 							// Если у клиента нет пакетов услуг
								КонецЕсли;	
							КонецЕсли;
						КонецЦикла;
							
						Если Описание = "Доступ разрешен" Тогда
							PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);
							Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);
						Иначе
							PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);
							Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);	
						КонецЕсли;
				//-- ЗМВ 07.07.2025				
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;
			#КонецОбласти				
			//-- ЗМВ 10.06.2025
			
			//++ ЗМВ 16.07.2025
			#Область ПроходыПомещений_КУРСК_Добавлено
			Если ВРег(СтруктурнаяЕдиница.Наименование) = ВРег("Курск") Тогда
				Для каждого Строка Из МассивПомещений Цикл	
					Если СтрНайти(ВРег(Строка.Наименование),ВРег("СПА")) > 0 Тогда	
						
						Для каждого СтрокаЧленство1 Из ТаблицаЧленств Цикл
							Если СтрНайти(ВРег(СтрокаЧленство1.Номенклатура.Наименование), "ПЛЮС") <> 0 ИЛИ СтрНайти(ВРег(СтрокаЧленство1.Номенклатура.Наименование), "VIP") <> 0 Тогда
								Описание = "Доступ разрешен";
								//++ ЗМВ 26.08.2025
								Прервать;
								//-- ЗМВ 26.08.2025
							Иначе	
								Описание = "Доступ запрещен, нет доступа к помещению";
							КонецЕсли;
						КонецЦикла;
						
						Если Описание = "Доступ разрешен" Тогда
							PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
							Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);	
						Иначе
							PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		
							Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false,"Доступ запрещен;нет доступа;к помещению", УИДВладельцаКарты);		
						КонецЕсли;
						
					КонецЕсли;			
				КонецЦикла;			
			КонецЕсли;	
			#КонецОбласти			
			//-- ЗМВ 16.07.2025
			
			//Исключить из проверки на время посещения						
			Если PocketKey_Исключения.PocketKey_ИсключитьИзПроверкиНаВремяПосещения(ДанныеКарты.ВладелецКарты) ИЛИ
				PocketKey_Исключения.PocketKey_ИсключитьИзПроверкиНаВремяПосещения(СтрокаЧленство.Номенклатура) Тогда
				
				// Проверяем есть ли у клиента закрытый шкафчик, только на выходе из клуба.
				Если Не ЭтоВход И ЗначениеЗаполнено(НомерШкафчика) И ПараметрыПодключения.НеВыпускатьСЗакрытымШкафчиком
					И Не МенеджерОборудованияСКУД_КОРП.ШкафчикАрендован(Дата, СтруктурнаяЕдиница, ДанныеКарты.ВладелецКарты, НомерШкафчика) Тогда
					Описание    = "Доступ запрещен, закрыт шкафчик " + формат(НомерШкафчика, "ЧГ=");
					PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

					Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;закрыт шкафчик;" + формат(НомерШкафчика, "ЧГ="), УИДВладельцаКарты);
					
				ИначеЕсли Не ЭтоВход И ЗначениеЗаполнено(НомерСейфа) И ПараметрыПодключения.НеВыпускатьСЗакрытымШкафчиком
					И Не МенеджерОборудованияСКУД_КОРП.ШкафчикАрендован(Дата, СтруктурнаяЕдиница, ДанныеКарты.ВладелецКарты, НомерСейфа) Тогда
					
					Описание    = "Доступ запрещен, закрыт сейф " + формат(НомерСейфа, "ЧГ=");
					PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);
					
					Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;закрыт сейф;" + формат(НомерСейфа, "ЧГ="), УИДВладельцаКарты);
					
				КонецЕсли;
				
				// Проверяем клиента на долги.
				СуммаДолга = РегистрыНакопления.РасчетыСПокупателями.ПолучитьЗадолженностьПоКонтрагентуСУчетомРассрочек(ДанныеКарты.ВладелецКарты, Дата, СтруктурнаяЕдиница);
				Если СуммаДолга > 0 И РегистироватьПроход Тогда
					
					РазрешитьПроходСДолгом = Константы[?(ЭтоВход, "РазрешатьВходКлиентовСЗадолженностью", "РазрешатьВыходКлиентовСЗадолженностью")].Получить();		
					НастройкиУсловий       = Константы[?(ЭтоВход, "РазрешатьВходКлиентовСЗадолженностьюУсловия", "РазрешатьВыходКлиентовСЗадолженностьюУсловия")].Получить().Получить();
					
					Если РазрешитьПроходСДолгом Тогда
						
						Если НастройкиУсловий.Сумма > 0 И СуммаДолга > НастройкиУсловий.Сумма Тогда
							НаименованиеВалюты = ОбщегоНазначения.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
							Описание = СтрШаблон("Доступ запрещен, сумма долга клиента %1%2 превышает лимит %3%4", СуммаДолга, НаименованиеВалюты, НастройкиУсловий.Сумма, НаименованиеВалюты);
							PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);				
							
							Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрешен;долг " + СуммаДолга, УИДВладельцаКарты); 
						КонецЕсли;
						
						СтруктураДолга = РегистрыНакопления.РасчетыСПокупателями.ПолучитьСамыйРаннийДолгКонтрагента(ДанныеКарты.ВладелецКарты, Дата, СтруктурнаяЕдиница);
						Если НастройкиУсловий.Период > 0 И НЕ СтруктураДолга = Неопределено Тогда
							КоличествоДней = Цел((НачалоДня(Дата) - НачалоДня(СтруктураДолга.Дата)) / 86400);
							Если КоличествоДней > НастройкиУсловий.Период Тогда
								Описание = СтрШаблон("Доступ запрещен, количество дней задолженности %1 превышает лимит дней %2", КоличествоДней, НастройкиУсловий.Период);
								PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);											
								
								Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;количество дней;задолженности;" + КоличествоДней, УИДВладельцаКарты);                                                                                      						
							КонецЕсли;					
						КонецЕсли;				
					Иначе
						НаименованиеВалюты = ОбщегоНазначения.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
						Описание = СтрШаблон("Доступ запрещен, сумма долга клиента %1%2", СуммаДолга, НаименованиеВалюты);
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);				
						
						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;долг " + СуммаДолга, УИДВладельцаКарты);				
					КонецЕсли;
					
				КонецЕсли;	
				
					
					Описание = "Доступ разрешен";
					
					PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание, СтрокаЧленство.ЧленствоПакетУслуг,,Ложь);
					
					Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(true, "Проходите", УИДВладельцаКарты);
					
				КонецЕсли;
				
				
			КонецЦикла;
		КонецЕсли;
	//- Трегубов В.Н. 11.01.2022
	
	#КонецОбласти

	// Проверим на одновременное прикладывание карты к разным турникетам.
	Если ВремяБлокировки > 0 Тогда
		ПрикладываниеСостоялось = РегистрыСведений.ЖурналСобытийСКУД_КОРП.ПолучитьПоследнееПрикладывание(ДанныеКарты.ВладелецКарты, КодКарты, Дата, ВремяБлокировки);
		Если ПрикладываниеСостоялось Тогда
			Описание = "Доступ запрещен, карту прикладывали к турникету менее " + ВремяБлокировки + " секунд назад";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);		

			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;карту прикладывали к турникету;менее " + ВремяБлокировки + " секунд назад", УИДВладельцаКарты);

		КонецЕсли;	
	КонецЕсли;	

	Если РегистироватьПроход Тогда

		// Проверяем есть ли у клиента закрытый шкафчик, только на выходе из клуба.
		Если Не ЭтоВход И ЗначениеЗаполнено(НомерШкафчика) И ПараметрыПодключения.НеВыпускатьСЗакрытымШкафчиком
			И Не МенеджерОборудованияСКУД_КОРП.ШкафчикАрендован(Дата, СтруктурнаяЕдиница, ДанныеКарты.ВладелецКарты, НомерШкафчика) Тогда
			Описание    = "Доступ запрещен, закрыт шкафчик " + формат(НомерШкафчика, "ЧГ=");
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;закрыт шкафчик;" + формат(НомерШкафчика, "ЧГ="), УИДВладельцаКарты);
		КонецЕсли;

		// Проверяем есть ли у клиента закрытый сейф, только на выходе из клуба.
		Если Не ЭтоВход И ЗначениеЗаполнено(НомерСейфа) И ПараметрыПодключения.Свойство("НеВыпускатьСЗакрытымСейфом") И ПараметрыПодключения.НеВыпускатьСЗакрытымСейфом Тогда
			Описание    = "Доступ запрещен, закрыт сейф " + формат(НомерСейфа, "ЧГ=");
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;закрыт сейф;" + формат(НомерСейфа, "ЧГ="), УИДВладельцаКарты);
		КонецЕсли;                                                                                                                

		// Проверяем клиента на долги.
		СуммаДолга = РегистрыНакопления.РасчетыСПокупателями.ПолучитьЗадолженностьПоКонтрагентуСУчетомРассрочек(ДанныеКарты.ВладелецКарты, Дата, СтруктурнаяЕдиница);
		Если СуммаДолга > 0 Тогда

			РазрешитьПроходСДолгом = Константы[?(ЭтоВход, "РазрешатьВходКлиентовСЗадолженностью", "РазрешатьВыходКлиентовСЗадолженностью")].Получить();		
			НастройкиУсловий       = Константы[?(ЭтоВход, "РазрешатьВходКлиентовСЗадолженностьюУсловия", "РазрешатьВыходКлиентовСЗадолженностьюУсловия")].Получить().Получить();

			//-Трегубов
			//ЯндексЕда - вход/выход с долгом
			Если ТипЗнч(ДанныеКарты.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты") Тогда
				Если ДанныеКарты.ВладелецКарты.Наименование = "Яндекс Еда" Тогда
					РазрешитьПроходСДолгом = Истина;
					СуммаДолга = 0;
				КонецЕсли;
			КонецЕсли;
			//-Трегубов
			
			Если РазрешитьПроходСДолгом Тогда

				Если НастройкиУсловий.Сумма > 0 И СуммаДолга > НастройкиУсловий.Сумма Тогда
					НаименованиеВалюты = ОбщегоНазначения.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
					Описание = СтрШаблон("Доступ запрещен, сумма долга клиента %1%2 превышает лимит %3%4", СуммаДолга, НаименованиеВалюты, НастройкиУсловий.Сумма, НаименованиеВалюты);
					PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);				

					Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрешен;долг " + СуммаДолга, УИДВладельцаКарты); 
				КонецЕсли;

				СтруктураДолга = РегистрыНакопления.РасчетыСПокупателями.ПолучитьСамыйРаннийДолгКонтрагента(ДанныеКарты.ВладелецКарты, Дата, СтруктурнаяЕдиница);
				Если НастройкиУсловий.Период > 0 И НЕ СтруктураДолга = Неопределено Тогда
					КоличествоДней = Цел((НачалоДня(Дата) - НачалоДня(СтруктураДолга.Дата)) / 86400);
					Если КоличествоДней > НастройкиУсловий.Период Тогда
						Описание = СтрШаблон("Доступ запрещен, количество дней задолженности %1 превышает лимит дней %2", КоличествоДней, НастройкиУсловий.Период);
						PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);											

						Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;количество дней;задолженности;" + КоличествоДней, УИДВладельцаКарты);                                                                                      						
					КонецЕсли;					
				КонецЕсли;				
			Иначе
				НаименованиеВалюты = ОбщегоНазначения.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
				Описание = СтрШаблон("Доступ запрещен, сумма долга клиента %1%2", СуммаДолга, НаименованиеВалюты);
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);				

				Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;долг " + СуммаДолга, УИДВладельцаКарты);				
			КонецЕсли;

		КонецЕсли;

		Если Не ЭтоВход И ПараметрыПодключения.Свойство("НеВыпускатьБезСданногоИнвентаря") И ПараметрыПодключения.НеВыпускатьБезСданногоИнвентаря Тогда			

			Если РегистрыСведений.Аренда.ИнвентарьВАренде(Дата, СтруктурнаяЕдиница, ДанныеКарты.ВладелецКарты) Тогда

				Описание = "Доступ запрещен. Не сдан инвентарь";
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);				

				Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Доступ запрещен;Не сдан инвентарь", УИДВладельцаКарты);

			КонецЕсли;

		КонецЕсли;   

	КонецЕсли;

	// Проверям не является ли клиент гостем.
	ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	СтруктураДоступа = МенеджерОборудованияСКУД_КОРП.ЭтоГость(СтруктурнаяЕдиница, Дата, ДанныеКарты.ВладелецКарты, ДанныеКарты.Карта, МассивПомещений);
	ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ВремяВыполнения = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;	

	Если Не СтруктураДоступа.Гость Тогда
		ВремяНачалаОперации    = ТекущаяУниверсальнаяДатаВМиллисекундах();
		АктивироватьЧПУ        = ПараметрыПодключения.Свойство("АктивироватьЧленствоПакетУслугПриПроходе") И ПараметрыПодключения.АктивироватьЧленствоПакетУслугПриПроходе;
		СтруктураДоступа       = МенеджерОборудованияСКУД_КОРП.ПолучитьДоступ(ДанныеКарты.ВладелецКарты, ДанныеКарты.Карта, Дата, ЭтоВход, СтруктурнаяЕдиница, МассивПомещений, АктивироватьЧПУ, НеСоздаватьНовоеПосещение, ТребуетсяМедСправка, РегистироватьПроход);
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
	КонецЕсли;
	
	//++ЛАА //Добавить проверку на наличие штрафа в посещение, тем самым после его оплаты выпускаем в любое время, иначе не выпускаем если не попадает под условия  
	ИмеетсяШтраф = Ложь;
	Попытка
		Если СтруктураДоступа.Описание = "штраф" Тогда
			ИмеетсяШтраф = Истина;
		КонецЕсли;
	Исключение
		ИмеетсяШтраф = Ложь;
	КонецПопытки;	
	//--ЛАА
	
	Если НЕ ЭтоВход И ПараметрыПодключения.Свойство("ВсегдаРазрешатьВыход") И ПараметрыПодключения.ВсегдаРазрешатьВыход
		//++ЛАА
		И НЕ ИмеетсяШтраф
		//--ЛАА
		Тогда
		СтруктураДоступа.Доступ = Истина;
	КонецЕсли;

	Если СтруктураДоступа.Доступ Тогда		
		Описание = "Доступ разрешен";
		Если СтруктураДоступа.Свойство("Описание") Тогда
			Если ЗначениеЗаполнено(СтруктураДоступа.Описание) Тогда
				Описание = Описание + ", " + СтруктураДоступа.Описание;
			КонецЕсли;
		КонецЕсли;
		ОписаниеОтвета = "Проходите"; 
	ИначеЕсли ЗначениеЗаполнено(СтруктураДоступа.Описание) Тогда
		Описание = "Доступ запрещен, " + СтруктураДоступа.Описание; // запрет по мед. справки.
		ОписаниеОтвета = "Доступ запрещен;" +СтруктураДоступа.Описание;
	Иначе
		Описание = "Доступ запрещен, у клиента нет доступных оснований";
		ОписаниеОтвета = "Доступ запрещен";
	КонецЕсли;  	

	Описание = ?(СтруктураДоступа.Гость, "Гость. ", "") + Описание;
	PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание, СтруктураДоступа.Основание, ВремяВыполнения, СтруктураДоступа.Гость);

	Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(СтруктураДоступа.Доступ, ОписаниеОтвета, УИДВладельцаКарты);	

КонецФункции

&Вместо("SolariumGET")
// Функция, возвращает данные по солярию.
//
Функция PocketKey_SolariumGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
		
	Метод        = Запрос.ПараметрыURL["method"];	
	UIDТерминала = Запрос.ПараметрыЗапроса.Получить("dev_id");
	
	#Область Логирование_Добавлено
	//++ЛАА
	Попытка
		КодКарты		= Запрос.ПараметрыЗапроса.Получить("cardNumber");
	Исключение
		КодКарты		= 0;
	КонецПопытки;
	ТекстЛог = СтрШаблон("UIDТерминала: %1 | КодКарты: %2 | Метод: %3", UIDТерминала, КодКарты, Метод);
	ЗаписьЖурналаРегистрации("ТерФит. ПокетКей. SolariumGET", УровеньЖурналаРегистрации.Информация,,, ТекстЛог);
	//--ЛАА
	#КонецОбласти

	
	ПараметрыПодключения = Справочники.ПодключаемоеОборудование.ПолучитьПараметрыСолярияPocketKey(UIDТерминала);
	
	Если ПараметрыПодключения = Неопределено Тогда
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(Неопределено, ТекущаяДатаСеанса(), 5,,, UIDТерминала,,,"Не заданы настройки солярия в 1с!");
		Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Не заданы настройки солярия в 1с!"));
	КонецЕсли;	
	
	Дата              		 = ТекущаяДатаСеанса();
	СтруктурнаяЕдиница		 = ПараметрыПодключения.СтруктурнаяЕдиница;
	Помещение         		 = ПараметрыПодключения.Помещение;
	Услуга            		 = ПараметрыПодключения.Услуга;
	ВидЦен            		 = ПараметрыПодключения.ВидЦен;
	ОказыватьВДолг    		 = ПараметрыПодключения.ОказыватьВДолг;
	ОплачиватьСЛС     		 = ПараметрыПодключения.ОплачиватьСЛС;
	МенятьБайтыМестами		 = ?(ПараметрыПодключения.Свойство("МенятьБайтыМестами"), ПараметрыПодключения.МенятьБайтыМестами, Ложь);
	КонвертироватьКодКарты	 = ?(ПараметрыПодключения.Свойство("НеКонвертироватьКодКарты"), Не ПараметрыПодключения.НеКонвертироватьКодКарты, Истина);
	
	Если ВРег(Метод) = ВРег("getprice") Тогда
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ДатаОбработки",		Дата);
		СтруктураДанные.Вставить("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
		СтруктураДанные.Вставить("ВидЦен", 				ВидЦен);	
		СтруктураДанные.Вставить("Номенклатура", 		Услуга);
		
		СтруктураДанные = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		
		Если СтруктураДанные.Цена = 0 Тогда
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5,,, UIDТерминала,,,"Не задана цена услуги солярия в 1с!");
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Не задана цена услуги солярия в 1с!"));
		КонецЕсли; 		

		Ответ1с = Новый Структура;
		Ответ1с.Вставить("productId"   , Строка(Услуга.УникальныйИдентификатор()));
		Ответ1с.Вставить("productPrice", СтруктураДанные.Цена);
		Ответ1с.Вставить("productName" , Услуга.Наименование);
		
		Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Ответ1с);
		
	ИначеЕсли ВРег(Метод) = ВРег("search") Тогда
		
		КодКарты = Запрос.ПараметрыЗапроса.Получить("cardNumber");
		
		// Конвертируем код карты.
		Если КонвертироватьКодКарты Тогда
			Попытка
				КодКарты = PocketKey_Модуль.PocketKey_КонвертироватьКодКарты(КодКарты);
			Исключение			                                                                       		
				Описание = "Ошибка конвертации карты!"; 
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты,, UIDТерминала,,, Описание);
				
				Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nошибка\nконвертации кода"));
			КонецПопытки;
		ИначеЕсли МенятьБайтыМестами Тогда
			Попытка
				КодКарты = Сред(КодКарты, 7) + Сред(КодКарты, 1, 6);
			Исключение
				Описание = "Ошибка конвертации карты! Менять байты местами!"; 
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты,, UIDТерминала,,, Описание);
				
				Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nошибка\nконвертации кода"));
			КонецПопытки;
		КонецЕсли; 
		
				
		ДанныеКарты = Справочники.Карты.ПолучитьДанныеМагнитнойКартыКлюча(КодКарты);
		
		Если ДанныеКарты = Неопределено Тогда
			Описание = "Доступ запрещен, неизвестный код карты";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты,, UIDТерминала,,, Описание);
			
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nнеизвестный\nкод карты"));
			
		ИначеЕсли Не ЗначениеЗаполнено(ДанныеКарты.ВладелецКарты) Тогда
			Описание = "Доступ запрещен, карта не привязана к клиенту";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты,, UIDТерминала,,, Описание);			
				
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nкарта\nне привязана\nк клиенту"));
			
		ИначеЕсли ДанныеКарты.Заблокирована ИЛИ ДанныеКарты.ПометкаУдаления Тогда			
			Описание = "Доступ запрещен, карта заблокирована";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты, ДанныеКарты.Карта, UIDТерминала,,, Описание);
			
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nкарта\nзаблокирована"));
			
		КонецЕсли;
		
		Если ТипЗнч(ДанныеКарты.ВладелецКарты) = Тип("СправочникСсылка.Сотрудники") Тогда
			Если ЗначениеЗаполнено(ДанныеКарты.ВладелецКарты.Контрагент) Тогда
				Клиент = ДанныеКарты.ВладелецКарты.Контрагент;	
			Иначе				
				Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Сотрудник\nне указан\nкак клиент"));
			КонецЕсли;
		Иначе
			Клиент = ДанныеКарты.ВладелецКарты;			
		КонецЕсли;
		
		//++Лазарев
		Если НЕ Документы.Посещение.КлиентВКлубе(Клиент) Тогда
				Описание = "Доступ запрещен, клиент не в клубе (terfit)"; 
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты, ДанныеКарты.Карта, UIDТерминала,,, Описание);
				Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nклиент\nне в клубе"));
		КонецЕсли;
		//--Лазарев
		
		ПолКлиента  = PocketKey_Модуль.PocketKey_ПолучитьПолКлиента(Клиент.ПолКлиента);
		Организация = СтруктурнаяЕдиница.Организация;				
		
		// 1. Получим стоимость остатка услуг солярия у клиента. 
		СтоимостьКупленныхУслуг = PocketKey_Модуль.PocketKey_ПолучитьСтоимостьКупленныхУслуг(Дата, Клиент, Услуга, СтруктурнаяЕдиница, ВидЦен);
				
		// 2. Проверим остаток на лицевых счетах.		
		Если ОплачиватьСЛС Тогда			
			ТаблицаЛС = МенеджерОборудованияСКУД_КОРП.ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Дата, Организация, Клиент);
			ОстатокЛС = ТаблицаЛС.Итог("СуммаОстаток");
		Иначе
			ОстатокЛС   = 0;
		КонецЕсли;		
		
		Баланс = СтоимостьКупленныхУслуг + ОстатокЛС;
		
		Ответ1с = Новый Структура;
		Ответ1с.Вставить("id"           , Строка(Клиент.УникальныйИдентификатор()));
		Ответ1с.Вставить("firstName"    , Клиент.Имя);
		Ответ1с.Вставить("lastName"     , Клиент.Фамилия);
		Ответ1с.Вставить("sex"          , ПолКлиента);
		Ответ1с.Вставить("prepaidAmount", Баланс);
		Ответ1с.Вставить("isDebit"      , ОказыватьВДолг);
		
		//++Лазарев
		Описание = "Запрос остатка, " + Строка(Баланс) + " р. (для солярия) (terfit)";
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 4, КодКарты, ДанныеКарты.Карта, UIDТерминала,,, Описание);
		//--Лазарве

		Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Ответ1с);
		
	ИначеЕсли ВРег(Метод) = ВРег("buy")	ИЛИ ВРег(Метод) = ВРег("cancelbuy") Тогда   		
		
		UIDКлиента = Запрос.ПараметрыЗапроса.Получить("userId");
		Попытка
			КоличествоУслуг = Число(Запрос.ПараметрыЗапроса.Получить("quantity"));
		Исключение
			Описание = "Доступ запрещен, количество минут не получено";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5,,, UIDТерминала,,, Описание);
			
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nошибка\nколичества"));
		КонецПопытки; 
		
		Если КоличествоУслуг = 0 Тогда
			
			Описание = "Доступ запрещен, передано количество минут 0";
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5,,, UIDТерминала,,, Описание);
			
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nошибка\nколичества 0 минут"));	
			
		КонецЕсли;
		
		Попытка
			Клиент = PocketKey_Модуль.PocketKey_ПолучитьСсылкуОбъектаПоУИД(UIDКлиента, "Справочники", "Контрагенты");
		Исключение
			Клиент = Неопределено;
		КонецПопытки;
		
		Если Клиент = Неопределено Тогда
			Описание = "Доступ запрещен, клиент не найден UID: " + UIDКлиента;
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5,,, UIDТерминала,,, Описание);
			
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Доступ запрещен\nклиент\nне найден"));			
		КонецЕсли;
		
		ДанныеКарты = Справочники.Карты.ПолучитьКартуКлючКлиента(Клиент);
		Если Не ДанныеКарты = Неопределено Тогда
			КодКарты = ДанныеКарты.КодКарты;
			Карта    = ДанныеКарты.Карта;
		Иначе
			КодКарты = "";
			Карта    = Неопределено;
		КонецЕсли;		
		
		Если ВРег(Метод) = ВРег("buy") Тогда
			
			ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			СтруктураДоступа = МенеджерОборудованияСКУД_КОРП.ПолучитьДоступСолярий(СтруктурнаяЕдиница, Дата, Клиент, КодКарты, Помещение, Услуга, КоличествоУслуг, ОказыватьВДолг, ОплачиватьСЛС);
			ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ВремяВыполнения = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
			
			Если СтруктураДоступа.Доступ Тогда
				Описание = "Посещение солярия " + КоличествоУслуг + " мин.";
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 4, КодКарты, Карта, UIDТерминала,,, Описание,, ВремяВыполнения);  
				
				Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("billNumber", Строка(Новый УникальныйИдентификатор())));
			Иначе
				Если ЗначениеЗаполнено(СтруктураДоступа.ОписаниеОшибки) Тогда
					Описание = "Доступ запрещен, " + СтруктураДоступа.ОписаниеОшибки;
					ОписаниеСолярия = "Не хватает материалов";
				Иначе
					Описание = "Доступ запрещен, не хватает остатка услуг солярия. " + "Выбрано: " + КоличествоУслуг + " мин." + " Остаток: " + СтруктураДоступа.Количество;
					ОписаниеСолярия = "Извините,\nнедостаточно средств\nна балансе";
				КонецЕсли;
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты, Карта, UIDТерминала,,, Описание,, ВремяВыполнения);  
				
				Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", ОписаниеСолярия));  
			КонецЕсли; 
			
		Иначе // Прерывание сеанса солярия, принудительное нажатие на кнопку "стоп".
			
			// Делаем паузу в 5 секунд, если клиент сразу нажмет на кнопку стоп,
			// то занятие еще не успеет сформироваться в фоне!
			ОбщегоНазначенияБТС.Пауза(5);
			
			// 1. Найдем занятие солярия.
			Занятие = РегистрыСведений.ЖурналСобытийСКУД_КОРП.ПолучитьТекущееЗанятиеСолярия(Клиент, UIDТерминала); 
			
			Если Занятие = Неопределено Тогда
				Описание = "Ошибка отмены, занятие не найдено!";
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 5, КодКарты, Карта, UIDТерминала,,, Описание,, ВремяВыполнения);	
				
				Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Ошибка отмены\nобратитесь\nна рецепцию"));
			КонецЕсли;
			
			КлючФоновогоЗадания = Новый УникальныйИдентификатор;
			
			ПараметрыФоновогоЗадания = Новый Структура;
			ПараметрыФоновогоЗадания.Вставить("Дата"           , Дата);
			ПараметрыФоновогоЗадания.Вставить("Занятие"        , Занятие);	
			ПараметрыФоновогоЗадания.Вставить("КоличествоУслуг", КоличествоУслуг);
			ПараметрыФоновогоЗадания.Вставить("КодКарты"       , КодКарты);
			ПараметрыФоновогоЗадания.Вставить("Карта"          , Карта);
			ПараметрыФоновогоЗадания.Вставить("UIDТерминала"   , UIDТерминала);
			МассивПараметровВыполнитьБезопасно = Новый_Массив("МенеджерОборудованияСКУД_КОРП.ПересчитатьЗанятиеСолярияВФоне", Ложь, ПараметрыФоновогоЗадания);		
			
			//МенеджерОборудованияСКУД_КОРП.ПересчитатьЗанятиеСолярияВФоне(ПараметрыФоновогоЗадания);
			
			ФоновыеЗадания.Выполнить("ОбщегоНазначения.ВызовССервераПроцедурыФункции", МассивПараметровВыполнитьБезопасно, КлючФоновогоЗадания, "Солярий PocketKey, пересчет занятия");			
			
			Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("cancel_msg", "Время пересчитано\nСпасибо!"));
			
		КонецЕсли;
		
	КонецЕсли; 	
	
	PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1,,, UIDТерминала,,,"Метод не определен: " + Метод);
	Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("error", "Метод не определен: " + Метод));	

	//Результат = ПродолжитьВызов(Запрос);
	//Возврат Результат;
КонецФункции

&Вместо("EventsGET")
Функция PocketKey_EventsGET(Запрос)

	УстановитьПривилегированныйРежим(Истина);
	
	ИдУстройства = Запрос.ПараметрыЗапроса.Получить("id");
	КодКарты     = Запрос.ПараметрыЗапроса.Получить("uid");
	Дата         = ТекущаяДатаСеанса();
	Passage      = Истина;
	
	#Область Логирование_Добавлено
	//++ЛАА
	ТекстЛог = СтрШаблон("ИдУстройства: %1 | КодКарты: %2", ИдУстройства, КодКарты);
	ЗаписьЖурналаРегистрации("ТерФит. ПокетКей. EventsGET", УровеньЖурналаРегистрации.Информация,,, ТекстЛог);
	//--ЛАА
	#КонецОбласти


	ОбработчикДрайвера   = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСКУДPocketkey_КОРП;
	ПараметрыПодключения = МенеджерОборудованияСКУД_КОРП.ПолучитьПараметрыПодключенияСКУД(ОбработчикДрайвера);

	Если ПараметрыПодключения = Неопределено Тогда
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(Неопределено, Дата, 1, КодКарты,, ИдУстройства,,"Не заданы настройки СКУД!");
		Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("result", false));
	КонецЕсли;

	ЭтоВход                   = Неопределено;
	СтруктурнаяЕдиница        = Неопределено;     
	КонвертироватьКодКарты    = НЕ ПараметрыПодключения.НеКонвертироватьКодКарты;
	МенятьБайтыМестами        = ?(ПараметрыПодключения.Свойство("МенятьБайтыМестами"), ПараметрыПодключения.МенятьБайтыМестами  , Ложь);
	НеСоздаватьНовоеПосещение = ?(ПараметрыПодключения.Свойство("НеСоздаватьНовоеПосещение"), ПараметрыПодключения.НеСоздаватьНовоеПосещение, 0);
	СинхронизацияКлиента      = ?(ПараметрыПодключения.Свойство("СинхронизацияКлиента"), ПараметрыПодключения.СинхронизацияКлиента, Ложь);
	//ДоступFaceID              = ПараметрыПодключения.Свойство("ДоступFaceID") И ПараметрыПодключения.ДоступFaceID;
	// Face ID определяется по передаваемому префиксу в коде карты F:

	Если СтрНайти(КодКарты, "F:") > 0 Тогда
		ДоступFaceID = Истина;
		КодКарты = СтрЗаменить(КодКарты, "F:", "");		
	Иначе
		ДоступFaceID = Ложь;		
	КонецЕсли; 

	РегистироватьПроход = Ложь;
	Для Каждого ТочкаДоступа из ПараметрыПодключения.ТаблицаТочекДоступа Цикл
		Если Формат(ТочкаДоступа.КлючСтроки, "ЧГ=") = Строка(ИдУстройства) Тогда
			ЭтоВход				     = ТочкаДоступа.Направление;		// 0 - выход, 1 - вход, 
			СтруктурнаяЕдиница  	 = ТочкаДоступа.СтруктурнаяЕдиница;
			РегистироватьПроход 	 = ТочкаДоступа.РегистрироватьПроход;			
			НаименованиеУстройства   = ТочкаДоступа.ТочкаДоступа;
		КонецЕсли;
	КонецЦикла;	

	// Если не заполнена структурная единица, то возвращаем ошибку.
	Если СтруктурнаяЕдиница = Неопределено Тогда
		Описание = "Не заданы параметры контроллера в настройках СКУД!";
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,,ИдУстройства,, Описание);

		Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("result", false));
	КонецЕсли;

	// Актуализируем часовой пояс исходя из структурной единицы
	ЧасовойПоясТекущегоСеанса = ЧасовойПоясСеанса();
	ЧасовойПоясСЕ = СтруктурнаяЕдиница.ЧасовойПояс;
	Если ЧасовойПоясТекущегоСеанса <> ЧасовойПоясСЕ Тогда 
		УстановитьЧасовойПоясСеанса(ЧасовойПоясСЕ);
		Дата = ТекущаяДатаСеанса();
	КонецЕсли; 

	// Если доступ без карт.
	Если ДоступFaceID Тогда

		Попытка
			// Ищем клиента по коду карты, как есть
			Если СинхронизацияКлиента Тогда

				КодКарты = Сред(КодКарты, 2);			
				ДанныеКарты = Справочники.Карты.ПолучитьДанныеМагнитнойКартыКлюча(КодКарты);			

			Иначе
				// Ищем клиента по коду справочника. 
				ДанныеКарты = PocketKey_Модуль.ПолучитьДанныеКартыПоКодуБиометрии(КодКарты);

			КонецЕсли;		
		Исключение
			Описание = "Ошибка поиска по Face ID!"; 
			PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

			Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Ошибка;поиска по;Face ID!", "");	

		КонецПопытки;
	Иначе
		// Конвертируем код карты.
		Если КонвертироватьКодКарты Тогда
			Попытка
				КодКарты = PocketKey_Модуль.КонвертироватьКодКарты(КодКарты);
			Исключение			                                                                       		
				Описание = "Ошибка конвертации карты!"; 
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

				Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, Описание, "");
			КонецПопытки;
		ИначеЕсли МенятьБайтыМестами Тогда
			Попытка
				КодКарты = Сред(КодКарты, 7) + Сред(КодКарты, 1, 6);
			Исключение
				Описание = "Ошибка конвертации карты! Менять байты местами!"; 
				PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

				Возврат PocketKey_СтандартныйМодуль.СформироватьОтвет(false, "Ошибка;конвертации;карты!", "");
			КонецПопытки;
		КонецЕсли; 

		// Получаем данные карты.
		ДанныеКарты = Справочники.Карты.ПолучитьДанныеМагнитнойКартыКлюча(КодКарты);

	КонецЕсли;

	Если ДанныеКарты = Неопределено Тогда
		Описание = "Доступ запрещен, неизвестный код карты";
		PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата, 1, КодКарты,, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание);

		Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("result", false));	
	КонецЕсли;

	ВладелецКартыКонтрагент = (ТипЗнч(ДанныеКарты.ВладелецКарты) = Тип("СправочникСсылка.Контрагенты"));

	// Определяем основания прохода.	
	Гость     = Ложь;
	Основание = Неопределено;
	Если ВладелецКартыКонтрагент Тогда
		ДанныеОснования = РегистрыСведений.ЖурналСобытийСКУД_КОРП.ПолучитьОснованиеПрохода(ДанныеКарты.ВладелецКарты, КодКарты);
		Основание = ДанныеОснования.Основание;
		Гость     = ДанныеОснования.Гость;
	КонецЕсли;

	// Регистриуем проход. Для гостей посещение открывается и закрывается на рецепции.	
	мДатаНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Если РегистироватьПроход И Passage = Истина Тогда		

		Если Не Гость Тогда
			Если ТипЗнч(ДанныеКарты.ВладелецКарты) = Тип("СправочникСсылка.Сотрудники") и ПараметрыПодключения.КонтролироватьПроходыСотрудников Тогда
				МенеджерОборудованияСКУД_КОРП.СоздатьПроходСотрудника(СтруктурнаяЕдиница, ДанныеКарты.Карта, Дата, ЭтоВход);
			ИначеЕсли ВладелецКартыКонтрагент и ПараметрыПодключения.КонтролироватьПроходыКлиентов Тогда
				МенеджерОборудованияСКУД_КОРП.СоздатьПроходКлиента(СтруктурнаяЕдиница, ДанныеКарты.ВладелецКарты, ДанныеКарты.Карта, Дата, ЭтоВход, Основание, НеСоздаватьНовоеПосещение);
			КонецЕсли;
		КонецЕсли;

		// Добавляем запись прохода, для оповещения мониторинга клиентов.
		Если ВладелецКартыКонтрагент и ПараметрыПодключения.ОтображатьФотоКлиента Тогда
			МенеджерОборудованияСКУД_КОРП.СоздатьЗаписьДляОповещенияМониторингаКлиента(СтруктурнаяЕдиница, ПараметрыПодключения.СписокРабочихМест, ДанныеКарты.ВладелецКарты, ЭтоВход);
		КонецЕсли;

	КонецЕсли;

	мДатаКонца = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ВремяВыполнения = (мДатаКонца - мДатаНачала) /1000;	

	
	
	#Область Парковка_Добавлено
	
	Попытка
		ЭтоПарковка = ?(СтрНайти(ВРег(НаименованиеУстройства), "ПАРКОВКА") > 0, Истина, Ложь);
	Исключение
		ЭтоПарковка = Ложь;
	КонецПопытки;
	
	КодСобытия = ?(ЭтоПарковка, 6, ?(Passage, 2, 3));	
		
	#КонецОбласти
	
	// Фиксируем проход через турникет в журнале событий.
	Описание  = ?(Гость, "Гость. ", "") + ?(Passage, "Зарегистрирован проход", "Проход не выполнен");
	//ЛогироватьСобытие(СтруктурнаяЕдиница, Дата + 1, ?(Passage, 2, 3), КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание, Основание, ВремяВыполнения, Гость);
	PocketKey_СтандартныйМодуль.ЛогироватьСобытие(СтруктурнаяЕдиница, Дата + 1, КодСобытия, КодКарты, ДанныеКарты.Карта, ИдУстройства, НаименованиеУстройства, ЭтоВход, Описание, Основание, ВремяВыполнения, Гость);
	
	Возврат PocketKey_СтандартныйМодуль.ПолучитьHTTPОтвет(Новый Структура("result", true));

КонецФункции
                                     